// check index

import { 物品类型 } from './enum'
import { LootsColors } from './type'

export const MAP_MONS_OFFX = 100
export const DIMENSIONALMONSNUM = 100
export const LevelLimit = 105
export const otherLimit = 100
export const 光柱 = [0, 0, 0, 0, 0, 5, 4, 3]
export enum 检查状态Enum {
	进度条 = 1,
	暴击,
	BUFF显示,
	在线,
	宠物,
	元神,
	自动战斗,
	冰冻状态,
	石化状态,
	无法移动,
	中毒状态,
	灼伤状态,
	冻疮状态,
	易伤,
	虚弱,
	狂暴,
	无敌,
	修为碾压,
	天神下凡,
	天罡之气
}

//===============N标记===============持久化整形 怪物没有P变量
//怪物类型(五行)
export const ELEMENT_TYPE = 1

//====技能标记
//弹射标记
export const ejection = 10

export const PERIOD_DAY = 24 * 60 * 60 * 1000
export const PERIOD_WEAK = 7 * 24 * 60 * 60 * 1000


//s变量
export enum S变量_玩家 {
	//占位
	none,
	playerName,
	showName1,
	showName2,
	showName3,
	showName4,
	dimensionalName
}

export enum S变量_怪物 {
	归属人 = 1,
	当前血量 = 2,
	最大血量 = 3,
	攻击 = 4,
	魔法,
	道术,
	防御,
	魔御,
	破甲,
	破魔
}

export enum 怪物类型 {
	未知 = 0,
	宝宝 = 1,
	怪物 = 2
}

///** 幻化 0.武器，1，衣服，2，头顶称号，3.左侧称号，4.右侧称号，5.光环 6.内观 7。其他 */

export enum 幻化 {
	头顶称号,
	左侧称号,
	右侧称号,
	武器,
	衣服,
	副手,
	身上光环,
	脚底光环,
	内观,
	其他
}

//n变量
export enum N变量_怪物 {
	五行类型 = 1,
	怪物类型 = 2,
	怪物标记 = 3,
	切换归属人 = 4,
	目标Handle = 5,
	个人副本BOSS = 6,
	修炼 = 7,
	重生次数 = 8,
	星级 = 9,
	词缀0 = 10,
	词缀1 = 11,
	词缀2 = 12,
	词缀3 = 13,
	词缀4 = 14,
	词缀5 = 15,
	词缀6 = 16,
	词缀7 = 17,
	词缀8 = 18,
	词缀9 = 19,
	词缀10 = 20,
	/** 怪物技能间隔1-5 */
	skillInterval0 = 25,
	skillInterval1 = 26,
	skillInterval2 = 27,
	skillInterval3 = 28,
	skillInterval4 = 29,
	/** 技能ID1-5 */
	skillID0 = 30,
	skillID1 = 31,
	skillID2 = 32,
	skillID3 = 33,
	skillID4 = 34,
	/** 技能1-5冷却时间 */
	skillCD0 = 35,
	skillCD1 = 36,
	skillCD2 = 37,
	skillCD3 = 38,
	skillCD4 = 39,
	中毒 = 40,
	吸血 = 41,
	命中几率 = 47,
	躲闪几率 = 48,
	暴击几率 = 49,
	暴击伤害 = 50,
	伤害减免 = 51,
	近战减免 = 52,
	远程减免 = 53,
	暴击抵抗 = 56,
	暴击伤害减少 = 57,
	易伤 = 58,
	造成伤害减少 = 59,
	特殊掉落 = 69,
	物品等级 = 70
}

export enum BUFF图标_E {
	'buff107' = 1500,
	'buff101' = 1500,
	'buff102' = 1501,
	'buff103' = 1502,
	'buff104' = 1503,
	'buff105' = 1504,
	'buff106' = 1505
}

export enum BUFF问题_E {
	'buff107' = '状态:中毒,每秒将会持续受到伤害',
	'buff101' = '状态:中毒',
	'buff102' = '状态:受到伤害增加',
	'buff103' = '状态:造成伤害减少',
	'buff104' = '状态:无法移动',
	'buff105' = '状态:无法移动',
	'buff106' = '状态:无敌'
}

export enum 副本 {
	普通副本,
	深渊,
	挑战深渊,
	五行塔,
	通天塔,
	秘境,
	挑战秘境,
	个人BOSS副本,
	首领房间,
	BOSS之家,
	金币副本,
	装备材料副本,
	技能材料副本,
	修为副本,
}

export enum 五行属性_E {
	metal = 1,
	wood = 2,
	water = 3,
	fire = 4,
	earth = 5
}

export enum 五行百分比_E {
	metal = 16,
	wood = 17,
	water = 18,
	earth = 19,
	fire = 20
}

export const 地图传送点 = [
	[0, 0],
	[946, 935],
	[875, 462],
	[735, 693],
	[496, 844],
	[440, 494],
	[97, 774],
	[799, 100],
	[494, 199],
	[228, 205],
	[233, 452]
]
// export enum five_element_s_enum {
// 	metal = 21,
// 	wood = 22,
// 	water = 23,
// 	earth = 24,
// 	fire = 25
// }

// export enum five_element_s_pct_enum {
// 	metal = 26,
// 	wood = 27,
// 	water = 28,
// 	earth = 29,
// 	fire = 30
// }

//===============P标记===============临时整型

//===============S标记===============临时字符
export const TAG_NAME = 1
export const TAG_TIME = 2
export const EJECTION_RANGE = 6

// 仓库类型
export const STORES_TYPE = {
	0: [],
	1: [物品类型.武器1, 物品类型.男性衣服, 物品类型.女性衣服, 物品类型.头盔, 物品类型.斗笠, 物品类型.项链1, 物品类型.项链2, 物品类型.戒指1, 物品类型.手镯3, 物品类型.腰带, 物品类型.靴子, 物品类型.勋章, 物品类型.印章, 物品类型.面巾, 物品类型.十二生肖, 物品类型.首饰盒],
	2: [31, 42],
	3: [71]
}

//五行地图坐标
export const FIVE_MAPXY = [
	[34, 35],
	[13, 16],
	[36, 37],
	[36, 37],
	[34, 35],
	[35, 36]
]

//五行下层坐标
export const FIVE_NEXT_MAPXY = [
	[12, 6],
	[14, 4],
	[16, 6],
	[15, 5],
	[13, 3],
	[14, 6]
]


export const 人物界面强化坐标 = [
	[20, 152], //衣服
	[96, 432], //武器
	[239, 60], //勋章
	[239, 152], //项链
	[20, 108], //头盔
	[20, 200], //左手镯
	[239, 200], //右手镯
	[20, 250], //左戒指
	[239, 250], //右戒指
	[239, 108], //面巾
	[20, 296], //腰带
	[239, 296], //鞋
	[20, 60],//刻印
	[0, 0],
	[0, 0],
	[0, 0],
	[171, 233]
]

export const 强化界面坐标 = [
	[27, 71], //衣服
	[98, 214], //武器
	[238, -19], //勋章
	[238, 71], //项链
	[26, 26], //头盔
	[26, 119], //左手镯
	[238, 119], //右手镯
	[26, 167], //左戒指
	[238, 168], //右戒指
	[238, 27], //面巾
	[26, 213], //腰带
	[238, 213], //鞋
	[25, -19],//刻印
	[0, 0],
	[0, 0],
	[0, 0],
	[168, 214],//副手
]

export enum 普通装备OutWay {
	锻造点数 = 0,
	装备星级,
	幸运值,
	基础属性标题 = 3,
	攻击属性,
	体质属性,
	防御属性,

	元素属性标题 = 7,
	元素属性1,
	元素属性2,

	特殊属性标题 = 10,
	特殊属性1,
	特殊属性2,
	特殊属性3,
	特殊属性4,
	特殊属性5,

	职业共鸣 = 16,

	强化标题 = 17,
	强化属性1,
	强化属性2,
	强化属性3,

	宝石标题 = 23,
	宝石插孔1,
	宝石插孔2,
	宝石插孔3,


	装备来源标题 = 34,
	装备来源1,
	装备来源2,
	装备来源3,
	装备描述,
	备注 = 39,
	战力 = 40
}

export enum 法宝OutWay {
	等级 = 0, //
	持久,
	基础属性标题 = 3,
	法宝属性1,
	法宝属性2,
	法宝属性3,
	法宝属性4,

	特殊属性标题 = 10,
	特殊属性1,
	特殊属性2,
	特殊属性3,
	特殊属性4,

	法宝特效标题 = 20,
	法宝特效,
	法宝特效1标题 = 22,
	法宝特效1,

	装备来源标题 = 34,
	装备来源1,
	装备来源2,
	装备来源3,
	装备描述,
	备注 = 39,
}

export enum 神器OutWay {
	等级, //备用
	持久,
	基础属性标题 = 2,
	神器属性1,
	神器属性2,
	神器属性3,
	神器属性4,
	神器属性5,
	神器特效标题,
	神器特效,
	神器强化条件标题,
	神器强化条件,

	装备来源标题 = 34,
	装备来源1,
	装备来源2,
	装备来源3,
	装备描述,
	备注 = 39,
}

export enum 专属装备OutWay {
	锻造点数 = 0,
	属性增幅,
	基础属性标题 = 2,
	专属属性1,
	专属属性2,
	专属属性3,
	专属属性4,

	专属特殊标题 = 10,
	特殊属性1,
	特殊属性2,
	特殊属性3,
	特殊属性4,

	专属特效标题 = 20,
	专属特效,

	装备来源标题 = 34,
	装备来源1,
	装备来源2,
	装备来源3,
	装备描述,
	备注 = 39,
	战力 = 40
}

export enum 特殊OutWay {
	锻造点数 = 0,
	修为加持 = 1, //备用
	属性标题 = 2,

	冷却时间 = 3,
	触发几率 = 3,
	触发间隔 = 3,

	恢复血量 = 4,
	落地范围 = 4,
	吸收伤害 = 4,
	真实伤害 = 4,

	特殊属性标题 = 5,

	特殊属性1 = 6,
	特殊属性2 = 7,
	特殊属性3 = 8,
	特殊属性4 = 9,
	特殊属性5 = 10,

	特效标题 = 15,
	特效 = 16
}

export enum 装备描述 {
	普通装备 = 450,
	神器装备 = 451,
	法宝装备 = 452,
	专属装备 = 453,
	强化材料,
	神器碎片,
	法宝碎片,
	职业秘籍,
	法宝卷轴,
	金币,
	元宝,
	充值币,
	恢复药水,
	精力药水,
	变性药水,
	沃玛号角,
	传送石,
	随机石,
	打孔石,
	五行符文金,
	五行符文木,
	五行符文水,
	五行符文火,
	五行符文土,
	技能晶石,
	锻造符文1,
	锻造符文2,
	锻造符文3,
	锻造符文4,
	锻造雕文1,
	锻造雕文2,
	锻造雕文3,
}

export const comprehendLimit = {
	level: 100,
	place: 100,
	monster: 50,
	other: 1000
}
export enum comprehendLimitType {
	level,
	place,
	pagoda,
	monster,
	other
}

export enum fiveEffectLimitType {
	level,
	place,
	pagoda,
	monster,
	other
}

export enum 物品标记 {
	品质 = 12,
	使用时间,
	重铸位置,
	等待删除,
	仓库不显示,
	元神装备,
	神话装备,
}

export const dimensionalMapXY = [
	[73, 74],
	[76, 203],
	[142, 142],
	[216, 191],
	[216, 191]
]
export const levelsXY = [
	[355, 320],
	[455, 370],
	[560, 410],
	[500, 480],

	[460, 480],
	[405, 450],
	[340, 450],
	[240, 470],

	[250, 410],
	[210, 360],
	[160, 330],
	[80, 300],

	[50, 280],
	[60, 350],
	[35, 420],
	[20, 462],

	[320, 270],
	[240, 280],
	[190, 240],
	[100, 200],

	[80, 180],
	[50, 140],
	[90, 100],
	[120, 100],

	[230, 95],
	[290, 70],
	[350, 50],
	[380, 50],

	[430, 200],
	[340, 170],
	[360, 110],
	[400, 130],

	[490, 150],
	[550, 170],
	[600, 210],
	[560, 260],

	[640, 300],
	[690, 260],
	[690, 200],
	[700, 150]
]

export const bosslost = ['南明法宝碎片', '无行法宝碎片', '赤阴法宝碎片', '天封法宝碎片', '伏羲法宝碎片', '青牛法宝碎片', '天龙法宝碎片', '玄都法宝碎片', '破天法宝碎片', '金牛法宝碎片']

export const leveldifficulty = ['普通', '困难', '大师', '噩梦', '地狱', '炼狱']
export const FIVE_ELEMENT_ = ['金属性', '木属性', '水属性', '火属性', '土属性', '法宝']
export const 五行名字 = ['金', '木', '水', '火', '土']
export const FIVE_ELEMENT_T = ['金', '木', '土', '水', '火']
export const FIVE_ELEMENT_K = ['木', '土', '水', '火', '金']
export const FIVE_ELEMENT_S = ['水', '火', '金', '木', '土']
export const 五行名字颜色 = ['fff799', '4f6f46', '87c0ca', 'd9883d', 'b6a014']
export const 五行名字颜色1 = ['fff799', '4f6f46', '87c0ca', 'd9883d', 'b6a014']
export const JOB_NAME = ['战士', '法师', '道士', '全部']
export const JOBNAMES = ['战士', '剑魂', '天罡', '法师', '御剑', '元素', '道士', '阵法', '诡道']
export const FIVE_ELEMENT_ATTR = ['攻击', '恢复', '护甲', '破甲', '体质']
export const FIVE_NAME = ['五行塔:金', '五行塔:木', '五行塔:水', '五行塔:火', '五行塔:土', '镇妖塔']
export const WEAPONNAME = ['衣服', '武器', '勋章', '项链', '头盔', '左护腕', '右护腕', '左戒指', '右戒指', '面巾', '腰带', '靴子', '印章', '无1', '无2', '无3', '盾牌']
export const WEAPONNAME1 = ['武器', '衣服', '项链', '头盔', '护腕', '戒指', '腰带', '靴子']
export const GROOVEATTRNAME = ['力量', '护甲', '抗性', '专精', '恢复']
export const GROOVE = ['红宝石', '黄宝石', '紫宝石', '绿宝石', '蓝宝石']
export const GROOVECOLOR = ['58', '251', '253', '218', '168']
export const GROOVESTARTINDEX = [142, 170, 100, 128, 156]

export const GROOVEQUALITIES = ['分裂的', '切割的', '方形的', '菱形的', '精致的', '晶莹的', '清澈的', '无暇的', '灿烂的', '璀璨的', '闪耀的', '纯净的', '耀眼的', '完美的']
export const GROOVEQUALATTR = [5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70]
export const QUALITIES_NAME = [
	'「一阶」',
	'「二阶」',
	'「三阶」',
	'「四阶」',
	'「五阶」',
	'「六阶」',
	'「七阶」',
	'「八阶」',
	'「九阶」',
	'「十阶」',
	'「十一阶」',
	'「十二阶」',
	'「十三阶」',
	'「十四阶」',
	'「十五阶」'
]

export const NUMBERCN = ['一', '二', '三', '四', '五', '六', '七', '八', '九', '十']

export const SECRETNAME = ['武技', '功法', '身法', '心法', '神通', '绝技']
export const WarriorFetter = [1, 3, 5, 6, 8, 13, 14, 15]
export const WizardFetter = [2, 4, 9, 10, 11, 43, 46, 47, 49, 50, 51, 65]
export const TaoistFetter = [7, 22, 23, 24, 25, 26, 28, 29, 31, 34, 48, 69, 88]

export const WarriorFetterValue = [25, 20, 10]
export const WizardFetterValue = [10, 20, 10]
export const TaoistFetterValue = [20, 30, 20]

export const DEFENSEMAX = 99
export const bindItem = ['星辰法宝碎片', '青龙法宝碎片', '灭世法宝碎片', '生命之石']
// 装备类型名称
export const ITEM_TYPE = {
	5: '武器',
	10: '衣服(男)',
	11: '衣服(女)',
	15: '头盔',
	20: '项链',
	26: '手镯',
	22: '戒指',
	27: '腰带',
	28: '鞋子',
	25: '面巾',
	30: '勋章',
	7: '印章',
	8: '盾牌'
}

export const fiveMagicEffectName = {
	3: ['使你所有金系伤害提升 10%', '使你所有木系伤害提升 10%', '使你所有水系伤害提升 10%', '使你所有火系伤害提升 10%', '使你所有土系伤害提升 10%'],
	5: ['使自身的攻击属性提升 10%', '使你所有的宠物属性提升 20%', '水系伤害对冰冻的敌人额外造成 30%', '有 5% 的几率造成真实伤害', '使你的血量和护甲提升 15%'],
	7: [
		'有 10% 几率额外造成  150% 的金系伤害',
		'毒箭会让敌人中毒,在 10 秒内将对敌人造成  300% 的法宝伤害',
		'受到伤害时,有 5% 施法寒冰冲击,冻结附近敌人 3 秒',
		'火球击中敌人时有 5% 触发火焰陨石,对范围内敌人造成 150% 的法宝伤害',
		'受伤时有 5% 反击敌人,对其造成 100% 的法宝伤害'
	]
}

export enum buff_enum {
	进度条 = 200,
	伤害加成, //伤害加成
	易伤, // 易伤
	伤害减少, //伤害减少
	晕迷, //石化
	禁止移动, // 禁止移动 行走 和 跑步都不允许
	无敌, //无敌

	中毒, //中毒
	灼伤, //中毒
	冻疮, //中毒

	骑马, //骑马
	火球术, //火球术
	冰冻, //冰冻
	连续受到玩家技能攻击, //

	自动追踪玩家, //boss自动追踪玩家
	延迟技能,
	连击技能,
	自动施法, //自动施法
	自动近战攻击, //自动近战攻击
	自动秘籍攻击, //秘籍自动攻击
	自动施法近战技能,
	元神自动施法,
	autoNotTargetMagic, //自动释放无目标技能
	经验加成,
	清理NPC,
	激活NPC,
	攻击速度,
	生命流失,
	消失,
	释放开天斩,
	清除归属人,
	延迟掉血,
	天谴,
	怪物切换归属人
}

export const debuffStatusArr = [102, 103, 104, 107]

// 动作对应的技能Id
export enum action_enum {
	no_action = 0,
	// 施法动作
	cast_magic = 89,
	// 普通攻击
	common_attack = 60,
	// 腾空旋转投掷
	spin_throw = 77,
	// 击打
	strike_attack = 78,
	// 反腿踢
	reverse_kick = 80,
	// 太极推手
	taiji_push = 81,
	// 腾空投掷
	flying_throw = 83,
	// 腾空连续出拳
	continuous_punch = 84,
	// 锤击地面
	hammer_ground = 86,
	// 旋转出击
	rotation_attack = 87,
	// 射击
	shooting_attack = 151,
	// 分身攻击
	split_attack = 154,
	// 冲刺
	sprint_attack = 168,
	// 闪现
	instantaneous_move = 231
}

// F1-F6
export const 复古按键 = [112, 113, 114, 115, 116, 117]
// q w e r d f
export const 全新按键 = [81, 87, 69, 82, 68, 70]

export const 复古按键文字 = ['F1', 'F2', 'F3', 'F4', 'F5', 'F6']
export const 全新按键文字 = ['Q', 'W', 'E', 'R', 'D', 'F']
export const 技能最大范围 = 10

// 普通攻击触发技能列表
export const 普攻触发技能列表: number[] = [1, 3, 6, 21, 32, 41, 42, 44, 61, 62, 63, 81, 104, 109, 110, 114, 115]
// 被动技能列表
export const 被动技能列表: number[] = [14, 73]
export const 飞行技能列表: number[] = [65, 54, 107]
export const 召唤类技能: number[] = [7, 28, 48, 69, 88, 97]
// 手动开关非近战技能
export const 手动开关非近战技能: number[] = [8]
// 对自身释放的技能
export const 对自身施法技能列表: number[] = [24, 25, 58]
//export const 对自身施法技能列表: number[] = [7, 24, 25, 28, 48, 58, 69, 88, 97]
// 无需选中目标
export const 无需目标技能: number[] = [2, 8, 15, 24, 30, 43, 47, 49, 54, 55, 63, 64, 71, 87, 95, 116, 117, 118, 119]
// 受伤触发列表
export const 受伤触发技能列表: number[] = [5, 25, 46, 73, 86]
// 需要选中目标技能列表
export const 需要选中目标技能列表: number[] = [3, 22, 27, 65, 66, 67, 82, 101, 105, 107, 112]
// 不触发自动攻击的技能列表
export const 不触发自动攻击技能列表: number[] = [...普攻触发技能列表, ...被动技能列表, ...对自身施法技能列表, ...受伤触发技能列表]

export const BOSS地图增益列表 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

export const 技能品质触发特效 = [3, 6, 9]
export const EFFECT_LEVEL = [3, 6, 9]
export const EFFECT_LEVEL1 = [21, 81, 141, 201]
export const EFFECT_LEVEL2 = [41, 101, 161, 221]
export const EFFECT_LEVEL3 = [61, 121, 181, 241]
export const EFFECT_LEVEL_ALL = [21, 41, 61, 81, 101, 121, 141, 161, 181, 201, 221, 241]
export const 初始背包大小 = 118

export enum NPC外观 {
	旅行商人 = 20005,
	无敌塔 = 20010,
	坐骑塔 = 20011,
	攻击塔 = 20012,
	闪电塔 = 20013,
	火焰塔 = 20014,
	奇遇1 = 20015,
	奇遇2 = 20016,
	奇遇3 = 20017,
	经验池 = 20018,
	神秘宝箱 = 59,
	时空裂缝 = 20026,
	悬赏任务 = 49
}

// export const 地图事件NPC = {
// 	"宝箱": { appr: 20020, name: "宝箱", unitName: "box" },
// 	"经验池": { appr: 20018, name: "宝箱", unitName: "box" },
// 	"宝箱": { appr: 20020, name: "宝箱", unitName: "box" },
// 	"宝箱": { appr: 20020, name: "宝箱", unitName: "box" },
// 	"宝箱": { appr: 20020, name: "宝箱", unitName: "box" },
// }

export const functionNpc = GameLib.GetQFunctionNpc()

export enum 法宝被动属性 {
	dc = '力量',
	ps = '智力',
	hpRenew = '精神',
	acb = '敏捷',
	ac = '根骨'
}

export const suitItemName701 = ['天魔神甲', '圣战宝甲', '圣战头盔', '圣战项链', '圣战手镯', '圣战戒指', '怒斩']

export const suitItemName711 = ['法神披风', '霓裳羽衣', '法神头盔', '法神项链', '法神手镯', '法神戒指', '龙牙']

export const suitItemName721 = ['天尊道袍', '天师长袍', '天尊头盔', '天尊项链', '天尊手镯', '天尊戒指', '逍遥扇']

export const MONS_XY = [
	[55, 37],
	[64, 29],
	[72, 37],
	[63, 46],
	[64, 37],
	[35, 58],
	[43, 66],
	[35, 74],
	[27, 66],
	[35, 66]
]

export const PRIMORDIAL_FAST_GOLD = [50, 50, 100, 100, 100, 200, 200, 200, 300, 400, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500]
export const MAGIC47_XY: number[][] = [
	[-2, 5],
	[-3, -2],
	[-4, 1],
	[-1, 4],
	[3, 2],
	[5, 0],
	[5, -2],
	[-2, -1],
	[2, -1],
	[3, -2]
]
export const DEBUGSERVERID = 1
export const RogueLikeJob0 = [44, 41, 110, 1, 62, 42, 81, 66, 8, 29, 87, 84, 5, 86, 6, 63, 32, 33, 15, 74, 95]
export const RogueLikeJob1 = [65, 101, 54, 108, 2, 64, 10, 11, 47, 49, 68, 14, 73, 46, 70, 12, 51, 9, 43, 75, 55]
export const RogueLikeJob2 = [67, 22, 21, 106, 24, 26, 25, 27, 52, 53, 7, 28, 69, 88, 48, 45, 71, 31, 34, 93, 35]

export const SKILLJOBID0 = [44, 41, 110, 1, 62, 42, 81, 66, 8, 29, 87, 84, 5, 86, 6, 63, 32, 33, 15, 74, 95]
export const SKILLJOBID1 = [65, 101, 54, 108, 2, 64, 10, 11, 47, 49, 68, 14, 73, 46, 70, 12, 51, 9, 43, 75, 55]
export const SKILLJOBID2 = [67, 22, 21, 106, 24, 26, 25, 27, 52, 53, 7, 28, 69, 88, 48, 45, 71, 31, 34, 93, 35]
export const SKILLJOBID = [
	1, 2, 3, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 21, 22, 23, 24, 26, 27, 28, 31, 32, 33, 36, 37, 38, 39, 41, 42, 43, 44, 46, 47, 48, 51, 52, 53, 54, 56, 57, 58, 61, 62, 63, 66, 67, 68, 69, 71,
	72, 73, 76, 77, 78, 79, 80, 81, 82, 83, 86, 87, 88
]
export const 神器品质: string[] = ['上品', '极品', '仙品', '神话']
export const 神器品质颜色: number[] = [LootsColors.purple, LootsColors.orange, LootsColors.red, LootsColors.white]
export const 境界大段 = ['凡人', '练气', '筑基', '金丹', '元婴', '出窍', '合体', '天人', '大乘', '化神']
export const 境界 = [
	'凡人',
	'练气初期',
	'练气中期',
	'练气后期',
	'筑基初期',
	'筑基中期',
	'筑基后期',
	'金丹初期',
	'金丹中期',
	'金丹后期',
	'元婴初期',
	'元婴中期',
	'元婴后期',
	'出窍初期',
	'出窍中期',
	'出窍后期',
	'合体初期',
	'合体中期',
	'合体后期',
	'无人初期',
	'无人中期',
	'无人后期',
	'大乘初期',
	'大乘中期',
	'大乘后期',
	'化神初期',
	'化神中期',
	'化神后期'
]
export const 体质基数 = 20
export const QUALITIESFIVEMAGIC: string[] = ['', '一阶', '二阶', '三阶', '四阶', '五阶', '六阶', '七阶', '八阶', '九阶', '十阶', '十一阶', '十二阶', '十三阶', '十四阶', '十五阶']
export const 品质名字: string[] = ['凡品', '下品', '中品', '精品', '上品', '极品', '仙品', '神话']
export const 属性条数: string[] = ['不限', '2条', '3条', '4条']
export const 属性范围: string[] = ['不限', '高范围', '满属性']
export const 品质颜色: number[] = [LootsColors.grey, LootsColors.green, LootsColors.bule, LootsColors.purple, LootsColors.yellow, LootsColors.orange, LootsColors.red, LootsColors.white]

//export const MAGICQUALITIES: string[] = ['', '普通', '稀有', '金色稀有', '史诗', '金色史诗', '传说', '金色传说', '远古', '金色远古', '太古', '太古', '太古', '太古', '太古', '太古']
export const MagicFiveNeed = [1, 1, 4, 2, 8, 8, 4, 2, 2, 2, 2, 2]
export const MAGICQUALITIES_COLOR: number[] = [0, 250, 154, 154, 253, 253, 149, 149, 70, 70, 246, 246, 246, 246, 246, 246]
export const QUALITY_ADDITION: number[] = [1, 1, 1.4, 1.8, 2.2, 2.4, 2.6, 2.8, 3.0, 3.2, 3.4, 3.45, 3.5, 3.55, 3.6, 3.65]
export const ITEM_QUALITY_ADDITION: number[] = [1, 2, 4, 6, 10, 15, 20, 30]
//export const ITEM_QUALITY_ADDITION: number[] = [1, 1.2, 1.4, 1.6, 1.8, 2.0, 2.2, 2.2, 2.2, 2.2]
export const 技能解锁等级 = [1, 10, 20, 30, 40, 50]
export const MAGICWEAPONLEVEL = [100, 500, 1000, 2000, 4000, 8000, 10000, 12000, 14000, 16000, 18000, 20000]
export const 地图难度需要修为 = [1000, 5000, 7000, 10000, 15000]
export const 掉落装备类型: number[] = [物品类型.武器1, 物品类型.男性衣服, 物品类型.女性衣服, 物品类型.头盔, 物品类型.斗笠, 物品类型.项链1, 物品类型.项链2, 物品类型.戒指1, 物品类型.手镯3, 物品类型.腰带, 物品类型.靴子, 物品类型.勋章, 物品类型.印章, 物品类型.面巾]
export const 可合成装备列表: number[] = [5, 10, 11, 15, 20, 22, 26, 27, 28]
export const 回收装备类型: number[] = [物品类型.武器1, 物品类型.男性衣服, 物品类型.女性衣服, 物品类型.头盔, 物品类型.斗笠, 物品类型.项链1, 物品类型.项链2, 物品类型.戒指1, 物品类型.手镯3, 物品类型.腰带, 物品类型.靴子, 物品类型.勋章, 物品类型.印章, 物品类型.面巾]
export const ATTACKSTDMODE: number[] = [物品类型.武器1, 22, 15, 20]
export const ATTACKWHERE: number[] = [0, 2, 3, 5]

export const MAGICWEAPON_INDEX_0: number[] = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
export const MAGICWEAPON_INDEX_1: number[] = [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35]
export const MAGICWEAPON_INDEX_2: number[] = [41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55]
export const MAGICWEAPON_INDEX_3: number[] = [61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75]
export const MAGICWEAPON_INDEX_4: number[] = [81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95]
export const MAGICWEAPON_INDEX_5: number[] = [101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115]
export const FIVE_ELEMENT_PAGODA: number[] = [3, 9, 4, 8, 2]

export const SkillType1 = [1, 2, 3, 31, 32, 33, 61, 62, 63]
export const SkillType2 = [6, 7, 8, 9, 36, 37, 38, 39, 66, 67, 68, 69]
export const SkillType3 = [11, 12, 13, 14, 41, 42, 43, 44, 71, 72, 73]
export const SkillType4 = [16, 17, 18, 46, 47, 48, 76, 77, 78, 79, 80]
export const SkillType5 = [21, 22, 23, 24, 51, 52, 53, 54, 81, 82, 83]
export const SkillType6 = [26, 27, 28, 56, 57, 58, 86, 87, 88]
export const SkillType6_ = [27, 28, 57, 58, 86, 87, 88]

export const FORGINGLIST = {
	0: '井中月|魔杖|银蛇|裁决之杖|血饮|骨玉权杖|无极棍|屠龙|嗜魂法杖|龙纹剑|怒斩|龙牙|逍遥扇',
	1: '天魔神甲|圣战宝甲|法神披风|霓裳羽衣|天尊道袍|天师长袍|战神盔甲(男)|战神盔甲(女)|恶魔长袍(男)|恶魔长袍(女)|幽灵战衣(女)|幽灵战衣(男)',
	2: '幽灵项链|生命项链|天珠项链|绿色项链|恶魔铃铛|灵魂项链|圣战项链|法神项链|天尊项链',
	3: '黑铁头盔|圣战头盔|法神头盔|天尊头盔',
	4: '幽灵手套|思贝儿手镯|心灵手镯|骑士手镯|龙之手镯|圣战手镯|天尊手镯|法神手镯|三眼手镯',
	5: '龙之戒指|红宝石戒指|铂金戒指|力量戒指|紫碧螺|龙之戒指|泰坦戒指|圣战戒指|法神戒指|天尊戒指',
	6: '钢铁腰带|圣殿腰带',
	7: '避魂靴|圣殿靴'
}
export const wDress = {
	0: '天魔神甲|法神披风|天尊道袍|战神盔甲(男)|恶魔长袍(男)|幽灵战衣(男)',
	1: '圣战宝甲|霓裳羽衣|天师长袍|战神盔甲(女)|恶魔长袍(女)|幽灵战衣(女)'
}

export const equalList = [{ lv: 1, where1: '', where2: '' }]

export enum E_物品品质 {
	普通,
	精良,
	稀有,
	史诗,
	罕见,
	传说,
	远古,
	神话
}
export enum 首杀BOSS类型 {
	史诗BOSS,
	传说BOSS,
	远古BOSS,
	神话BOSS,
	洪荒BOSS,
}

export enum mon_tag {
	NPC,
	普通怪物,
	稀有怪物,
	史诗BOSS,
	传说BOSS,
	远古BOSS,
	神话BOSS,
	洪荒BOSS,
	特殊怪物,
}

export enum 法宝列表 {
	'离火',
	'逐风',
	'破军',
	'斩月',
	'飞羽',
	'龙鳞',
	'霜剑',
	'雷锤',
	'云袍',
	'炎杖',
	'星链',
	'龙枪',
	'凤琴',
	'玄龟',
	'麒麟',
	'神鹰',
	'龙马',
	'虎符',
	'玉蝶',
	'金鹏',
	'玄狐',
	'白鹿',
	'紫电',
	'青霜',
	'蓝玉',
	'红绫',
	'黑石',
	'黄沙',
	'天霜',
	'地火',
	'水镜',
	'山灵',
	'云隐',
	'月华',
	'日辉',
	'星耀',
	'天网',
	'地藏',
	'冰心',
	'风刃',
	'电闪',
	'火龙',
	'水蛇',
	'金狮',
	'土象',
	'木鹿',
	'暗刺',
	'光盾',
	'雪剑',
	'霜刀',
	'雷鞭',
	'电链',
	'火环',
	'火雨',
	'金翅',
	'玉簪',
	'雷音',
	'凤羽',
	'白玉',
	'地虎',
	'黄铜',
	'天罗',
	'玉兔',
	'赤霞',
	'青天',
	'碧海',
	'霜狼',
	'星辰',
	'雷龙',
	'天龙',
	'金牛',
	'水月',
	'火凤',
	'风象',
	'南明',
	'无行',
	'赤阴',
	'天封',
	'伏羲',
	'青牛',
	'雪狐',
	'玄都',
	'破天',
	'龙蛇',
	'龙吟',
	'碧光',
	'莫邪',
	'红炎',
	'七煞',
	'虎头',
	'青龙',
	'灭世',
	'碧月',
	'雷霆',
	'天罡',
	'冰霜',
	'黑耀',
	'五行',
	'九天',
	'蛇骨',
	'玉笛',
	'秋水',
	'苍穹',
	'孤舟',
	'寒鸦',
	'锦瑟',
	'瑶池',
	'墨痕',
	'翠微',
	'雁归',
	'寒梅',
	'苍梧',
	'皓月',
	'清风',
	'幽兰',
	'翠竹',
	'雅韵',
	'嫣然',
	'晨曦',
	'暮雨',
	'琉璃',
	'绮梦',
	'琴音',
	'剑影',
	'霜华',
	'雪霁',
	'碧波',
	'飞鸿',
	'落花',
	'飘香',
	'红尘',
	'缥缈',
	'禅意',
	'墨香',
	'琴瑟',
	'笙歌',
	'丹青',
	'浮生',
	'惊鸿',
	'霓裳',
	'韶华',
	'荏苒',
	'峥嵘',
	'琳琅',
	'窈窕',
	'芳华',
	'明月',
	'烟雨',
	'碧云',
	'流水',
	'书香',
	'玉宇',
	'青石',
	'琼浆',
	'瑶台',
	'锦绣',
	'柳絮',
	'霜雪',
	'乾坤',
	'莲步',
	'玲珑',
	'皑皑',
	'悠悠',
	'幽谷',
	'婵娟',
	'笙箫',
	'翩跹',
	'璎珞',
}

export enum 法宝效果名字 {
	'0天然洞穴',
	'1天然洞穴',
	'0兽人古墓',
	'1兽人古墓',
	'0废旧矿区',
	'1废旧矿区',
	'0秘密通道',
	'1秘密通道',
	'0毒蛇山谷',
	'1毒蛇山谷',
	'0沃玛森林',
	'1沃玛森林',
	'0沃玛寺庙',
	'1沃玛寺庙',
	'0教主大殿',
	'1教主大殿',
	'0蜈蚣洞穴',
	'1蜈蚣洞穴',
	'0骨魔洞',
	'1骨魔洞',
	'0尸魔谷',
	'1尸魔谷',
	'0封魔神殿',
	'1封魔神殿',
	'0石墓洞穴',
	'1石墓洞穴',
	'0祖玛寺庙',
	'1祖玛寺庙',
	'0牛魔寺庙',
	'1牛魔寺庙',
	'0赤月峡谷',
	'1赤月峡谷',
	'0魔龙血域',
	'1魔龙血域',
	'0冰寒地狱',
	'1冰寒地狱',
	'0火龙洞穴',
	'1火龙洞穴',
	'0狐月洞穴',
	'1狐月洞穴',
	'0远古神殿',
	'1远古神殿',
	'0瘟疫沼泽',
	'1瘟疫沼泽',
	'0半兽陵墓',
	'1半兽陵墓',
	'0石原洞穴',
	'1石原洞穴',
	'0叛乱洞穴',
	'1叛乱洞穴',
	'0寒冰之路',
	'1寒冰之路',
	'0幽灵洞穴',
	'1幽灵洞穴',
	'0迷失洞穴',
	'1迷失洞穴',
	'0弦月林',
	'1弦月林',
	'0月氏神殿',
	'1月氏神殿',
	'0异秘洞',
	'1异秘洞',
	'0尖啸地狱',
	'1尖啸地狱',
	'0石槽矿洞',
	'1石槽矿洞',
	'0望乡台',
	'1望乡台',
	'0货船仓库',
	'1货船仓库',
	'0业火地狱',
	'1业火地狱',
	'0暂未开放1',
	'1暂未开放1',
	'0暂未开放2',
	'1暂未开放2',
	'0暂未开放3',
	'1暂未开放3',
	'0暂未开放4',
	'1暂未开放4',
	'0暂未开放5',
	'1暂未开放5',
	'0暂未开放6',
	'1暂未开放6',
	'0暂未开放7',
	'1暂未开放7',
	'0暂未开放8',
	'1暂未开放8',
	'0暂未开放9',
	'1暂未开放9',
	'0暂未开放10',
	'1暂未开放10',
	'0暂未开放11',
	'1暂未开放11',
	'0暂未开放12',
	'1暂未开放12',
	'0暂未开放13',
	'1暂未开放13',
	'0暂未开放14',
	'1暂未开放14',
	'0暂未开放15',
	'1暂未开放15',
	'0暂未开放16',
	'1暂未开放16',
	'0暂未开放17',
	'1暂未开放17',
	'0暂未开放18',
	'1暂未开放18',
	'0暂未开放19',
	'1暂未开放19',
	'0暂未开放20',
	'1暂未开放20',
}
export enum 专属效果名字 {
	'刺杀剑法',
	'烈火剑法',
	'开天斩',
	'横扫千军',
	'裂空斩',
	'万剑归宗',
	'水月斩',
	'十字斩',
	'逐日剑法',
	'回旋斩',
	'金色弯刀',
	'无敌斩',
	'烈焰斩',
	'利剑突刺',
	'龙影剑法',
	'旋风斩',
	'降魔杵',
	'虎啸山河',
	'火球术',
	'冰咆哮',
	'流星火雨',
	'寒冰冲击',
	'火焰陨石',
	'九龙神火',
	'剑气诀',
	'立剑诀',
	'火雷剑',
	'冰剑诀',
	'太极剑法',
	'万剑诀',
	'寒冰箭',
	'雷电术',
	'元素爆裂',
	'雷爆术',
	'冰霜雪雨',
	'聚能爆破',
	'灵魂火符',
	'召唤神兽',
	'召唤月灵',
	'召唤麒麟',
	'召唤白虎',
	'召唤圣兽',
	'噬魂术',
	'天雷阵',
	'落石阵',
	'火陨阵',
	'无极剑阵',
	'奇门阵法',
	'毒箭术',
	'毒云',
	'双龙破',
	'阴阳法环',
	'湮灭',
	'五行阵',
}
export const GrooveName = [
	'分裂的紫宝石',
	'切割的紫宝石',
	'方形的紫宝石',
	'菱形的紫宝石',
	'精致的紫宝石',
	'晶莹的紫宝石',
	'清澈的紫宝石',
	'无暇的紫宝石',
	'灿烂的紫宝石',
	'璀璨的紫宝石',
	'闪耀的紫宝石',
	'纯净的紫宝石',
	'耀眼的紫宝石',
	'完美的紫宝石',
	'分裂的钻石',
	'切割的钻石',
	'方形的钻石',
	'菱形的钻石',
	'精致的钻石',
	'晶莹的钻石',
	'清澈的钻石',
	'无暇的钻石',
	'灿烂的钻石',
	'璀璨的钻石',
	'闪耀的钻石',
	'纯净的钻石',
	'耀眼的钻石',
	'完美的钻石',
	'分裂的绿宝石',
	'切割的绿宝石',
	'方形的绿宝石',
	'菱形的绿宝石',
	'精致的绿宝石',
	'晶莹的绿宝石',
	'清澈的绿宝石',
	'无暇的绿宝石',
	'灿烂的绿宝石',
	'璀璨的绿宝石',
	'闪耀的绿宝石',
	'纯净的绿宝石',
	'耀眼的绿宝石',
	'完美的绿宝石',
	'分裂的红宝石',
	'切割的红宝石',
	'方形的红宝石',
	'菱形的红宝石',
	'精致的红宝石',
	'晶莹的红宝石',
	'清澈的红宝石',
	'无暇的红宝石',
	'灿烂的红宝石',
	'璀璨的红宝石',
	'闪耀的红宝石',
	'纯净的红宝石',
	'耀眼的红宝石',
	'完美的红宝石',
	'分裂的蓝宝石',
	'切割的蓝宝石',
	'方形的蓝宝石',
	'菱形的蓝宝石',
	'精致的蓝宝石',
	'晶莹的蓝宝石',
	'清澈的蓝宝石',
	'无暇的蓝宝石',
	'灿烂的蓝宝石',
	'璀璨的蓝宝石',
	'闪耀的蓝宝石',
	'纯净的蓝宝石',
	'耀眼的蓝宝石',
	'完美的蓝宝石',
	'分裂的黄宝石',
	'切割的黄宝石',
	'方形的黄宝石',
	'菱形的黄宝石',
	'精致的黄宝石',
	'晶莹的黄宝石',
	'清澈的黄宝石',
	'无暇的黄宝石',
	'灿烂的黄宝石',
	'璀璨的黄宝石',
	'闪耀的黄宝石',
	'纯净的黄宝石',
	'耀眼的黄宝石',
	'完美的黄宝石'
]


export const 八方向坐标偏移 = [
	[0, -1],
	[1, -1],
	[1, 0],
	[1, 1],
	[0, 1],
	[-1, 1],
	[-1, 0],
	[-1, -1]
]


// export const NUMBER_UNIT = ["", "万", "亿", "兆", "京", 'aa', 'ab', 'ac', 'ad', 'ae', 'af', 'ag', 'ah', 'ai', 'aj', 'ak', 'al', 'am', 'an', 'ao', 'ap', 'aq', 'ar', 'as', 'at', 'au', 'av', 'aw', 'ax', 'ay', 'az', 'ba', 'bb', 'bc', 'bd', 'be', 'bf', 'bg', 'bh', 'bi', 'bj', 'bk', 'bl', 'bm', 'bn', 'bo', 'bp', 'bq', 'br', 'bs', 'bt', 'bu', 'bv', 'bw', 'bx', 'by', 'bz', 'ca', 'cb', 'cc', 'cd', 'ce', 'cf', 'cg', 'ch', 'ci', 'cj', 'ck', 'cl', 'cm', 'cn', 'co', 'cp', 'cq', 'cr', 'cs', 'ct', 'cu', 'cv', 'cw', 'cx', 'cy', 'cz', 'da', 'db', 'dc', 'dd', 'de', 'df', 'dg', 'dh', 'di', 'dj', 'dk', 'dl', 'dm', 'dn', 'do', 'dp', 'dq', 'dr', 'ds', 'dt', 'du', 'dv', 'dw', 'dx', 'dy', 'dz', 'ea', 'eb', 'ec', 'ed', 'ee', 'ef', 'eg', 'eh', 'ei', 'ej', 'ek', 'el', 'em', 'en', 'eo', 'ep', 'eq', 'er', 'es', 'et', 'eu', 'ev', 'ew', 'ex', 'ey', 'ez', 'fa', 'fb', 'fc', 'fd', 'fe', 'ff', 'fg', 'fh', 'fi', 'fj', 'fk', 'fl', 'fm', 'fn', 'fo', 'fp', 'fq', 'fr', 'fs', 'ft', 'fu', 'fv', 'fw', 'fx', 'fy', 'fz', 'ga', 'gb', 'gc', 'gd', 'ge', 'gf', 'gg', 'gh', 'gi', 'gj', 'gk', 'gl', 'gm', 'gn', 'go', 'gp', 'gq', 'gr', 'gs', 'gt', 'gu', 'gv', 'gw', 'gx', 'gy', 'gz', 'ha', 'hb', 'hc', 'hd', 'he', 'hf', 'hg', 'hh', 'hi', 'hj', 'hk', 'hl', 'hm', 'hn', 'ho', 'hp', 'hq', 'hr', 'hs', 'ht', 'hu', 'hv', 'hw', 'hx', 'hy', 'hz', 'ia', 'ib', 'ic', 'id', 'ie', 'if', 'ig', 'ih', 'ii', 'ij', 'ik', 'il', 'im', 'in', 'io', 'ip', 'iq', 'ir', 'is', 'it', 'iu', 'iv', 'iw', 'ix', 'iy', 'iz', 'ja', 'jb', 'jc', 'jd', 'je', 'jf', 'jg', 'jh', 'ji', 'jj', 'jk', 'jl', 'jm', 'jn', 'jo', 'jp', 'jq', 'jr', 'js', 'jt', 'ju', 'jv', 'jw', 'jx', 'jy', 'jz', 'ka', 'kb', 'kc', 'kd', 'ke', 'kf', 'kg', 'kh', 'ki', 'kj', 'kk', 'kl', 'km', 'kn', 'ko', 'kp', 'kq', 'kr', 'ks', 'kt', 'ku', 'kv', 'kw', 'kx', 'ky', 'kz', 'la', 'lb', 'lc', 'ld', 'le', 'lf', 'lg', 'lh', 'li', 'lj', 'lk', 'll', 'lm', 'ln', 'lo', 'lp', 'lq', 'lr', 'ls', 'lt', 'lu', 'lv', 'lw', 'lx', 'ly', 'lz', 'ma', 'mb', 'mc', 'md', 'me', 'mf', 'mg', 'mh', 'mi', 'mj', 'mk', 'ml', 'mm', 'mn', 'mo', 'mp', 'mq', 'mr', 'ms', 'mt', 'mu', 'mv', 'mw', 'mx', 'my', 'mz', 'na', 'nb', 'nc', 'nd', 'ne', 'nf', 'ng', 'nh', 'ni', 'nj', 'nk', 'nl', 'nm', 'nn', 'no', 'np', 'nq', 'nr', 'ns', 'nt', 'nu', 'nv', 'nw', 'nx', 'ny', 'nz', 'oa', 'ob', 'oc', 'od', 'oe', 'of', 'og', 'oh', 'oi', 'oj', 'ok', 'ol', 'om', 'on', 'oo', 'op', 'oq', 'or', 'os', 'ot', 'ou', 'ov', 'ow', 'ox', 'oy', 'oz', 'pa', 'pb', 'pc', 'pd', 'pe', 'pf', 'pg', 'ph', 'pi', 'pj', 'pk', 'pl', 'pm', 'pn', 'po', 'pp', 'pq', 'pr', 'ps', 'pt', 'pu', 'pv', 'pw', 'px', 'py', 'pz', 'qa', 'qb', 'qc', 'qd', 'qe', 'qf', 'qg', 'qh', 'qi', 'qj', 'qk', 'ql', 'qm', 'qn', 'qo', 'qp', 'qq', 'qr', 'qs', 'qt', 'qu', 'qv', 'qw', 'qx', 'qy', 'qz', 'ra', 'rb', 'rc', 'rd', 're', 'rf', 'rg', 'rh', 'ri', 'rj', 'rk', 'rl', 'rm', 'rn', 'ro', 'rp', 'rq', 'rr', 'rs', 'rt', 'ru', 'rv', 'rw', 'rx', 'ry', 'rz', 'sa', 'sb', 'sc', 'sd', 'se', 'sf', 'sg', 'sh', 'si', 'sj', 'sk', 'sl', 'sm', 'sn', 'so', 'sp', 'sq', 'sr', 'ss', 'st', 'su', 'sv', 'sw', 'sx', 'sy', 'sz', 'ta', 'tb', 'tc', 'td', 'te', 'tf', 'tg', 'th', 'ti', 'tj', 'tk', 'tl', 'tm', 'tn', 'to', 'tp', 'tq', 'tr', 'ts', 'tt', 'tu', 'tv', 'tw', 'tx', 'ty', 'tz', 'ua', 'ub', 'uc', 'ud', 'ue', 'uf', 'ug', 'uh', 'ui', 'uj', 'uk', 'ul', 'um', 'un', 'uo', 'up', 'uq', 'ur', 'us', 'ut', 'uu', 'uv', 'uw', 'ux', 'uy', 'uz', 'va', 'vb', 'vc', 'vd', 've', 'vf', 'vg', 'vh', 'vi', 'vj', 'vk', 'vl', 'vm', 'vn', 'vo', 'vp', 'vq', 'vr', 'vs', 'vt', 'vu', 'vv', 'vw', 'vx', 'vy', 'vz', 'wa', 'wb', 'wc', 'wd', 'we', 'wf', 'wg', 'wh', 'wi', 'wj', 'wk', 'wl', 'wm', 'wn', 'wo', 'wp', 'wq', 'wr', 'ws', 'wt', 'wu', 'wv', 'ww', 'wx', 'wy', 'wz', 'xa', 'xb', 'xc', 'xd', 'xe', 'xf', 'xg', 'xh', 'xi', 'xj', 'xk', 'xl', 'xm', 'xn', 'xo', 'xp', 'xq', 'xr', 'xs', 'xt', 'xu', 'xv', 'xw', 'xx', 'xy', 'xz', 'ya', 'yb', 'yc', 'yd', 'ye', 'yf', 'yg', 'yh', 'yi', 'yj', 'yk', 'yl', 'ym', 'yn', 'yo', 'yp', 'yq', 'yr', 'ys', 'yt', 'yu', 'yv', 'yw', 'yx', 'yy', 'yz', 'za', 'zb', 'zc', 'zd', 'ze', 'zf', 'zg', 'zh', 'zi', 'zj', 'zk', 'zl', 'zm', 'zn', 'zo', 'zp', 'zq', 'zr', 'zs', 'zt', 'zu', 'zv', 'zw', 'zx', 'zy', 'zz']

export const NUMBER_UNIT = ["", "万", "亿", "兆", "京","秭","穰","沟","涧","正","载","极","万极","亿极","兆极","京极","秭极","穰极","沟极","涧极","正极","载极","极极",
"帕","万帕","亿帕","兆帕","京帕","秭帕","穰帕","沟帕","涧帕","正帕","载帕","极帕","帕帕","古","万古","亿古","兆古","京古","垓古","秭古","穰古","沟古","涧古","正古","载古","极古","帕古","古古",
"希","万希","亿希","兆希","京希","垓希","秭希","穰希","沟希","涧希","正希","载希","极希","帕希","古希","希希","霾","万霾","亿霾","兆霾","京霾","垓霾","秭霾","穰霾","沟霾","涧霾","正霾","载霾","极霾","帕霾","古霾","希霾","霾霾",
"道","万道","亿道","兆道","京道","垓道","秭道","穰道","沟道","涧道","正道","载道","极道","帕道","古道","希道","霾道","道道",
"尼","万尼","亿尼","兆尼","京尼","垓尼","秭尼","穰尼","沟尼","涧尼","正尼","载尼","极尼","帕尼","古尼","希尼","霾尼","道尼","尼尼",
"临","万临","亿临","兆临","京临","垓临","秭临","穰临","沟临","涧临","正临","载临","极临","帕临","古临","希临","霾临","道临","尼临","临临",
"兵","万兵","亿兵","兆兵","京兵","垓兵","秭兵","穰兵","沟兵","涧兵","正兵","载兵","极兵","帕兵","古兵","希兵","霾兵","道兵","尼兵","临兵","兵兵",
"斗","万斗","亿斗","兆斗","京斗","垓斗","秭斗","穰斗","沟斗","涧斗","正斗","载斗","极斗","帕斗","古斗","希斗","霾斗","道斗","尼斗","临斗","兵斗","斗斗",
"者","万者","亿者","兆者","京者","垓者","秭者","穰者","沟者","涧者","正者","载者","极者","帕者","古者","希者","霾者","道者","尼者","临者","兵者","斗者","者者",
"皆","万皆","亿皆","兆皆","京皆","垓皆","秭皆","穰皆","沟皆","涧皆","正皆","载皆","极皆","帕皆","古皆","希皆","霾皆","道皆","尼皆","临皆","兵皆","斗皆","者皆","皆皆",
"阵","万阵","亿阵","兆阵","京阵","垓阵","秭阵","穰阵","沟阵","涧阵","正阵","载阵","极阵","帕阵","古阵","希阵","霾阵","道阵","尼阵","临阵","兵阵","斗阵","者阵","皆阵","阵阵",
"列","万列","亿列","兆列","京列","垓列","秭列","穰列","沟列","涧列","正列","载列","极列","帕列","古列","希列","霾列","道列","尼列","临列","兵列","斗列","者列","皆列","阵列","列列",
"在","万在","亿在","兆在","京在","垓在","秭在","穰在","沟在","涧在","正在","载在","极在","帕在","古在","希在","霾在","道在","尼在","临在","兵在","斗在","者在","皆在","阵在","列在","在在",
"前","万前","亿前","兆前","京前","垓前","秭前","穰前","沟前","涧前","正前","载前","极前","帕前","古前","希前","霾前","道前","尼前","临前","兵前","斗前","者前","皆前","阵前","列前","在前","前前",
"诛","万诛","亿诛","兆诛","京诛","垓诛","秭诛","穰诛","沟诛","涧诛","正诛","载诛","极诛","帕诛","古诛","希诛","霾诛","道诛","尼诛","临诛","兵诛","斗诛","者诛","皆诛","阵诛","列诛","在诛","前诛","诛诛",
]