export function Main(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    const S = `\\
    {I=140;F=NPCCK.DATA;X=683;Y=340} <{M=135,136,137;F=NPCCK.DATA;X=688;Y=380}/@进入地图(1,边界村,69,119)>\\
    {I=143;F=NPCCK.DATA;X=493;Y=350} <{M=135,136,137;F=NPCCK.DATA;X=498;Y=390}/@进入地图(1,主城,105,120)>\\
    {I=139;F=NPCCK.DATA;X=223;Y=120} <{M=135,136,137;F=NPCCK.DATA;X=218;Y=140}/@进入地图(1,庄园,59,59)>\\
    {I=142;F=NPCCK.DATA;X=293;Y=390} <{M=135,136,137;F=NPCCK.DATA;X=298;Y=430}/@进入地图(60,蛇妖谷,41,55)>\\
    {I=144;F=NPCCK.DATA;X=363;Y=170} <{M=135,136,137;F=NPCCK.DATA;X=368;Y=210}/@进入地图(100,3,334,336)>\\
    {I=141;F=NPCCK.DATA;X=513;Y=150} <{M=135,136,137;F=NPCCK.DATA;X=528;Y=190}/@进入地图(180,白云道观,176,327)>\\
    {I=138;F=NPCCK.DATA;X=743;Y=110} <{M=135,136,137;F=NPCCK.DATA;X=758;Y=150}/@进入地图(240,封印之城,240,201)>\\
    {S=序  幕:;C=243;X=780} <{s=边界村;c=150;X=830}/@进入地图(1,边界村,69,119)>\\\\
    {S=特  殊:;C=243;X=780} <{s=庄园;c=150;X=830}/@进入地图(1,庄园,59,59)>\\\\
    {S=第一幕:;C=243;X=780} <{s=主城;c=150;X=830}/@进入地图(1,主城,105,120)>\\\\
    {S=第二幕:;C=243;X=780} <{s=蛇妖谷;c=150;X=830}/@进入地图(60,蛇妖谷,41,55)>\\\\
    {S=第三幕:;C=243;X=780} <{s=土城;c=150;X=830}/@进入地图(100,3,334,336)>\\\\
    {S=第四幕:;C=243;X=780} <{s=白云道观;c=150;X=830}/@进入地图(180,白云道观,176,327)>\\\\
    {S=第五幕:;C=243;X=780} <{s=封印之城;c=150;X=830}/@进入地图(240,封印之城,240,201))>\\\\\\
    <{S=第六到十幕;C=191;X=800}/@Main1>\\
    \\
`
    Npc.SayEx(Player, '世界地图', S)
}

export function Main1(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    const S = `\\
    {I=155;F=NPCCK.DATA;X=183;Y=220} <{M=135,136,137;F=NPCCK.DATA;X=188;Y=260}/@进入地图(300,苍月岛,143,334)>\\
    {I=157;F=NPCCK.DATA;X=583;Y=230} <{M=135,136,137;F=NPCCK.DATA;X=600;Y=270}/@进入地图(360,上古圣地,123,156)>\\
    {I=154;F=NPCCK.DATA;X=383;Y=120} <{M=135,136,137;F=NPCCK.DATA;X=385;Y=160}/@进入地图(420,狐月山,88,110)>\\
    {I=159;F=NPCCK.DATA;X=743;Y=350} <{M=135,136,137;F=NPCCK.DATA;X=760;Y=390}/@进入地图(500,埋骨荒原,101,189)>\\
    {I=160;F=NPCCK.DATA;X=663;Y=470} <{M=135,136,137;F=NPCCK.DATA;X=680;Y=510}/@进入地图(650,魔神遗迹,330,298)>\\
    {I=156;F=NPCCK.DATA;X=743;Y=120} <{M=135,136,137;F=NPCCK.DATA;X=736;Y=160}/@进入地图(800,血狱,126,126)>\\
    {I=158;F=NPCCK.DATA;X=383;Y=350} <{M=135,136,137;F=NPCCK.DATA;X=400;Y=390}/@进入地图(1000,北冥魔境,172,133)>\\
    {S=第六幕:;C=243;X=140} <{s=苍月岛;c=150;X=190}/@进入地图(300,苍月岛,143,334)>\\\\
    {S=第七幕:;C=243;X=140} <{s=上古圣地;c=150;X=190}/@进入地图(360,上古圣地,123,156)>\\\\
    {S=第八幕:;C=243;X=140} <{s=狐月山;c=150;X=190}/@进入地图(420,狐月山,88,110)>\\\\
    {S=第九幕:;C=243;X=140} <{s=埋骨荒原;c=150;X=190}/@进入地图(500,埋骨荒原,101,189)>\\\\
    {S=第十幕:;C=243;X=140} <{s=魔神遗迹;c=150;X=190}/@进入地图(650,魔神遗迹,330,298)>\\\\
    {S=第十一幕:;C=243;X=140} <{s=血狱;c=150;X=195}/@进入地图(800,血狱,126,126)>\\\\
    {S=第十二幕:;C=243;X=140} <{s=北冥魔境;c=150;X=195}/@进入地图(1000,北冥魔境,172,133)>\\\\
    <{S=第一到五幕;C=191;X=800}/@Main>\\
`
    Npc.SayEx(Player, '世界地图1', S)
}

// 埋骨荒原
// 魔神遗迹
// 血狱
// 北冥魔境

export function 进入地图(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    let 等级 = Args.Int[0]
    let 地图名字 = Args.Str[1]
    let 坐标X = Args.Int[2]
    let 坐标Y = Args.Int[3]
    if (Player.GetLevel() < 等级) { Player.MessageBox(`等级不足${等级},无法进入${地图名字}`); return }
    Player.MapMove(地图名字, 坐标X, 坐标Y)
}