export function Main(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    if (Player.V.任务1 == false) { Player.MessageBox('请先完成新手任务\\点击屏幕上方新手任务即可查看!'); return }
    let S = ``
    switch (Npc.Tag) {
        case 1:
            S = `\\\\\\\\\\\\
                                      {S=★普通地图★;C=250}                              {S=★★★地狱地图★★★;C=243}\\\\
           {S=◆ 地图难度:普通;C=250}                                                     {S=◆ 地图名称:暗黑蛇谷;C=56}\\\\
           {S=◆ 地图星级:原始★;C=250}                                                   {S=◆ 地图难度:地狱;C=56}\\\\
           {s=60级:;c=250}{s=〖;c=250}<蛇妖山谷/@传送(60,蛇妖山谷)>{s=〗;c=250}   {s=80级:;c=250}{s=〖;c=250}<黑暗森林/@传送(80,黑暗森林)>{s=〗;c=250}   {s=100级:;c=250}{s=〖;c=250}<沃玛寺庙/@传送(100,沃玛寺庙)>{s=〗;c=250}           {S=◆ 需要提升好实力才能挑战;C=56}\\\\
                              {S=首领:;C=251} <{S=神庙主殿;C=243}/@传送(100,神庙主殿)>\\\\
                                                                              {S=◆ 地图星级:百倍★★★;C=56}\\
                              {S=★★噩梦地图★★;C=19}\\
                                                                              {S=◆ 最底刷新星级为100★;C=56}\\
           {S=◆ 地图难度:噩梦;C=19}\\
                                                                              {S=◆ 全部都是人形BOSS;C=56}\\
           {S=◆ 地图星级:十倍★★;C=19}\\\\ 
          {S=◆ 地图怪物:最低刷新档次邪恶级BOSS;C=19}                                   {S=进入条件:20礼卷;C=150}\\\\ 
          {S=◆ 进图条件:2礼卷;C=19}\\
                                 <{S=失落暗殿;C=19}/@噩梦地图(失落暗殿,2)>                                           <{S=开始挑战;C=251}/@暗黑地图(暗黑蛇谷,20)>       
`
            break
        case 2:
            S = `\\\\\\\\\\\\
                                       {S=★普通地图★;C=250}                             {S=★★★地狱地图★★★;C=243}\\\\
           {S=◆ 地图难度:普通;C=250}                                                     {S=◆ 地图名称:暗黑盟重;C=56}\\\\
           {S=◆ 地图星级:十倍★★;C=250}                                                 {S=◆ 地图难度:地狱;C=56}\\\\
           {s=120级:;c=250}{s=〖;c=250}<死亡山谷/@传送(120,死亡山谷)>{s=〗;c=250}   {s=140级:;c=250}{s=〖;c=250}<幽暗石墓/@传送(80,幽暗石墓)>{s=〗;c=250}   {s=160级:;c=250}{s=〖;c=250}<祖玛回廊/@传送(160,祖玛回廊)>{s=〗;c=250}         {S=◆ 需要提升好实力才能挑战;C=56}\\\\
                               {S=首领:;C=251} <{S=灰石墓穴;C=243}/@传送(160,灰石墓穴)>\\\\
                                                                               {S=◆ 地图星级:千倍★★★★;C=56}\\
                               {S=★★噩梦地图★★;C=19}\\
                                                                               {S=◆ 最底刷新星级为1000★;C=56}\\
            {S=◆ 地图难度:噩梦;C=19}\\
                                                                               {S=◆ 全部都是人形BOSS;C=56}\\
            {S=◆ 地图星级:百倍★★★;C=19}\\\\ 
           {S=◆ 地图怪物:最低刷新档次邪恶级BOSS;C=19}                                   {S=进入条件:30礼卷;C=150}\\\\ 
           {S=◆ 进图条件:3礼卷;C=19}\\
                                  <{S=失落暗殿;C=19}/@噩梦地图(诸侯领地,3)>                                           <{S=开始挑战;C=251}/@暗黑地图(暗黑盟重,30)>       
    `
            break
        case 3:
            S = `\\\\\\\\\\\\
                                        {S=★普通地图★;C=250}                             {S=★★★地狱地图★★★;C=243}\\\\
            {S=◆ 地图难度:普通;C=250}                                                     {S=◆ 地图名称:暗黑白日门;C=56}\\\\
            {S=◆ 地图星级:十倍★★;C=250}                                                 {S=◆ 地图难度:地狱;C=56}\\\\
            {s=180级:;c=250}{s=〖;c=250}<万妖森林/@传送(180,万妖森林)>{s=〗;c=250}   {s=200级:;c=250}{s=〖;c=250}<万妖峡谷/@传送(200,万妖峡谷)>{s=〗;c=250}   {s=220级:;c=250}{s=〖;c=250}<万妖之塔/@传送(220,万妖之塔)>{s=〗;c=250}         {S=◆ 需要提升好实力才能挑战;C=56}\\\\
                                {S=首领:;C=251} <{S=万妖塔顶;C=243}/@传送(220,万妖塔顶)>\\\\
                                                                                {S=◆ 地图星级:千倍★★★★;C=56}\\
                                {S=★★噩梦地图★★;C=19}\\
                                                                                {S=◆ 最底刷新星级为1000★;C=56}\\
             {S=◆ 地图难度:噩梦;C=19}\\
                                                                                {S=◆ 全部都是人形BOSS;C=56}\\
             {S=◆ 地图星级:百倍★★★;C=19}\\\\ 
            {S=◆ 地图怪物:最低刷新档次邪恶级BOSS;C=19}                                   {S=进入条件:40礼卷;C=150}\\\\ 
            {S=◆ 进图条件:4礼卷;C=19}\\
                                   <{S=万妖之巢;C=19}/@噩梦地图(万妖之巢,4)>                                           <{S=开始挑战;C=251}/@暗黑地图(暗黑白日门,40)>       
        `
            break
        case 4:
            S = `\\\\\\\\\\\\
                                        {S=★普通地图★;C=250}                             {S=★★★地狱地图★★★;C=243}\\\\
            {S=◆ 地图难度:普通;C=250}                                                     {S=◆ 地图名称:暗黑封魔谷;C=56}\\\\
            {S=◆ 地图星级:百倍★★★;C=250}                                                 {S=◆ 地图难度:地狱;C=56}\\\\
            {s=240级:;c=250}{s=〖;c=250}<封魔谷/@传送(240,封魔谷)>{s=〗;c=250}   {s=260级:;c=250}{s=〖;c=250}<恶魔监牢/@传送(260,恶魔监牢)>{s=〗;c=250}   {s=280级:;c=250}{s=〖;c=250}<铁血魔域/@传送(280,铁血魔域)>{s=〗;c=250}         {S=◆ 需要提升好实力才能挑战;C=56}\\\\
                                {S=首领:;C=251} <{S=封魔殿;C=243}/@传送(280,封魔殿)>\\\\
                                                                                {S=◆ 地图星级:万倍★★★★★;C=56}\\
                                {S=★★噩梦地图★★;C=19}\\
                                                                                {S=◆ 最底刷新星级为10000★;C=56}\\
             {S=◆ 地图难度:噩梦;C=19}\\
                                                                                {S=◆ 全部都是人形BOSS;C=56}\\
             {S=◆ 地图星级:千倍★★★★;C=19}\\\\ 
            {S=◆ 地图怪物:最低刷新档次邪恶级BOSS;C=19}                                   {S=进入条件:50礼卷;C=150}\\\\ 
            {S=◆ 进图条件:5礼卷;C=19}\\
                                   <{S=不归路;C=19}/@噩梦地图(不归路,5)>                                           <{S=开始挑战;C=251}/@暗黑地图(暗黑封魔谷,50)>       
            `
            break
        case 5:
            S = `\\\\\\\\\\\\
                                       {S=★普通地图★;C=250}                             {S=★★★地狱地图★★★;C=243}\\\\
           {S=◆ 地图难度:普通;C=250}                                                     {S=◆ 地图名称:暗黑苍月岛;C=56}\\\\
           {S=◆ 地图星级:百倍★★★;C=250}                                                 {S=◆ 地图难度:地狱;C=56}\\\\
           {s=300级:;c=250}{s=〖;c=250}<尸魔洞/@传送(300,尸魔洞)>{s=〗;c=250}   {s=320级:;c=250}{s=〖;c=250}<骨魔洞/@传送(320,骨魔洞)>{s=〗;c=250}   {s=340级:;c=250}{s=〖;c=250}<牛魔寺庙/@传送(340,牛魔寺庙)>{s=〗;c=250}         {S=◆ 需要提升好实力才能挑战;C=56}\\\\
                               {S=首领:;C=251} <{S=奈何桥;C=243}/@传送(340,奈何桥)>\\\\
                                                                               {S=◆ 地图星级:万倍★★★★★;C=56}\\
                               {S=★★噩梦地图★★;C=19}\\
                                                                               {S=◆ 最底刷新星级为10000★;C=56}\\
            {S=◆ 地图难度:噩梦;C=19}\\
                                                                               {S=◆ 全部都是人形BOSS;C=56}\\
            {S=◆ 地图星级:千倍★★★★;C=19}\\\\ 
           {S=◆ 地图怪物:最低刷新档次邪恶级BOSS;C=19}                                   {S=进入条件:60礼卷;C=150}\\\\ 
           {S=◆ 进图条件:6礼卷;C=19}\\
                                  <{S=寺庙大厅;C=19}/@噩梦地图(寺庙大厅,6)>                                           <{S=开始挑战;C=251}/@暗黑地图(暗黑苍月岛,60)>       
             `
            break
        case 6:
            S = `\\\\\\\\\\\\
                                       {S=★普通地图★;C=250}                             {S=★★★地狱地图★★★;C=243}\\\\
           {S=◆ 地图难度:普通;C=250}                                                     {S=◆ 地图名称:暗黑魔龙城;C=56}\\\\
           {S=◆ 地图星级:千倍★★★★;C=250}                                                 {S=◆ 地图难度:地狱;C=56}\\\\
           {s=360级:;c=250}{s=〖;c=250}<魔龙沼泽/@传送(360,魔龙沼泽)>{s=〗;c=250}   {s=380级:;c=250}{s=〖;c=250}<火龙巢穴/@传送(380,火龙巢穴)>{s=〗;c=250}   {s=400级:;c=250}{s=〖;c=250}<九幽海域/@传送(400,九幽海域)>{s=〗;c=250}         {S=◆ 需要提升好实力才能挑战;C=56}\\\\
                               {S=首领:;C=251} <{S=火龙神殿;C=243}/@传送(400,火龙神殿)>\\\\
                                                                               {S=◆ 地图星级:十万倍★★★★★★;C=56}\\
                               {S=★★噩梦地图★★;C=19}\\
                                                                               {S=◆ 最底刷新星级为100000★;C=56}\\
            {S=◆ 地图难度:噩梦;C=19}\\
                                                                               {S=◆ 全部都是人形BOSS;C=56}\\
            {S=◆ 地图星级:万倍★★★★★;C=19}\\\\ 
           {S=◆ 地图怪物:最低刷新档次邪恶级BOSS;C=19}                                   {S=进入条件:200礼卷;C=150}\\\\ 
           {S=◆ 进图条件:20礼卷;C=19}\\
                                  <{S=魔龙圣地;C=19}/@噩梦地图(魔龙圣地,20)>                                           <{S=开始挑战;C=251}/@暗黑地图(暗黑魔龙城,200)>       
             `
            break
        case 7:
            S = `\\\\\\\\\\\\
                                       {S=★普通地图★;C=250}                             {S=★★★地狱地图★★★;C=243}\\\\
           {S=◆ 地图难度:普通;C=250}                                                     {S=◆ 地图名称:暗黑狐月山;C=56}\\\\
           {S=◆ 地图星级:千倍★★★★;C=250}                                                 {S=◆ 地图难度:地狱;C=56}\\\\
           {s=420级:;c=250}{s=〖;c=250}<狐月小径/@传送(420,狐月小径)>{s=〗;c=250}   {s=440级:;c=250}{s=〖;c=250}<雪域冰山/@传送(440,雪域冰山)>{s=〗;c=250}   {s=460级:;c=250}{s=〖;c=250}<雪域冰宫/@传送(460,雪域冰宫)>{s=〗;c=250}         {S=◆ 需要提升好实力才能挑战;C=56}\\\\
                               {S=首领:;C=251} <{S=雪域王殿;C=243}/@传送(460,雪域王殿)>\\\\
                                                                               {S=◆ 地图星级:十万倍★★★★★★;C=56}\\
                               {S=★★噩梦地图★★;C=19}\\
                                                                               {S=◆ 最底刷新星级为100000★;C=56}\\
            {S=◆ 地图难度:噩梦;C=19}\\
                                                                               {S=◆ 全部都是人形BOSS;C=56}\\
            {S=◆ 地图星级:万倍★★★★★;C=19}\\\\ 
           {S=◆ 地图怪物:最低刷新档次邪恶级BOSS;C=19}                                   {S=进入条件:400礼卷;C=150}\\\\ 
           {S=◆ 进图条件:40礼卷;C=19}\\
                                  <{S=神域冰谷;C=19}/@噩梦地图(神域冰谷,40)>                                           <{S=开始挑战;C=251}/@暗黑地图(暗黑狐月山,400)>       
             `
            break
        case 8:
            S = `\\\\\\\\\\\\
                                           {S=★普通地图★;C=250}                             {S=★★★地狱地图★★★;C=243}\\\\
               {S=◆ 地图难度:普通;C=250}                                                     {S=◆ 地图名称:暗黑埋骨荒原;C=56}\\\\
               {S=◆ 地图星级:万倍★★★★;C=250}                                                 {S=◆ 地图难度:地狱;C=56}\\\\
               {s=500级:;c=250}{s=〖;c=250}<四方祭坛/@传送(500,四方祭坛)>{s=〗;c=250}   {s=550级:;c=250}{s=〖;c=250}<蛮荒丛林/@传送(550,蛮荒丛林)>{s=〗;c=250}   {s=600级:;c=250}{s=〖;c=250}<沙漠绿洲/@传送(600,沙漠绿洲)>{s=〗;c=250}         {S=◆ 需要提升好实力才能挑战;C=56}\\\\
                                   {S=首领:;C=251} <{S=暗黑神殿;C=243}/@传送(600,暗黑神殿)>\\\\
                                                                                   {S=◆ 地图星级:百万倍★★★★★★;C=56}\\
                                   {S=★★噩梦地图★★;C=19}\\
                                                                                   {S=◆ 最底刷新星级为100万★;C=56}\\
                {S=◆ 地图难度:噩梦;C=19}\\
                                                                                   {S=◆ 全部都是人形BOSS;C=56}\\
                {S=◆ 地图星级:十万倍★★★★★;C=19}\\\\ 
               {S=◆ 地图怪物:最低刷新档次邪恶级BOSS;C=19}                                   {S=进入条件:600礼卷;C=150}\\\\ 
               {S=◆ 进图条件:60礼卷;C=19}\\
                                      <{S=荒芜山谷;C=19}/@噩梦地图(荒芜山谷,60)>                                           <{S=开始挑战;C=251}/@暗黑地图(暗黑埋骨荒原,600)>       
                             `
            break
        case 9:
            S = `\\\\\\\\\\\\
                                            {S=◆ 地图难度:普通;C=250}                           {S=★★★地狱地图★★★;C=243}\\\\
                {S=◆ 怪物星级:1亿-10亿;C=250}       {s=650级:;c=250}{s=〖;c=250}<三叉岛/@传送啊(650,三叉岛,50)>{s=〗;c=250}   {S=◆ 进图条件:50礼卷;C=19}    {S=◆ 地图名称:暗黑魔神遗迹;C=56}\\\\
                                            {S=◆ 地图难度:中等;C=251}                        {S=◆ 怪物星级:200亿-2000亿;C=56}\\\\
                {S=◆ 怪物星级:3亿-30亿;C=251}      {s=700级:;c=251}{s=〖;c=251}<纷争之地/@传送啊(700,纷争之地,100)>{s=〗;c=251} {S=◆ 进图条件:100礼卷;C=19}   {S=◆ 全部都是人形BOSS;C=56}\\\\
                                            {S=◆ 地图难度:高级;C=253}                        {S=◆ 全部为幻化级别;C=56}\\\\
                {S=◆ 怪物星级:6亿-60亿;C=253}      {s=750级:;c=253}{s=〖;c=253}<熔火地狱/@传送啊(750,熔火地狱,200)>{s=〗;c=253} {S=◆ 进图条件:200礼卷;C=19}\\\\
                                            {S=◆ 地图难度:困难;C=254}                        {S=◆ 此地图怪物防御高,攻击强;C=154}\\\\
                {S=◆ 怪物星级:10亿-100亿;C=254}     {S=750级:;C=254} <{S=神魔战场;C=251}/@传送啊(750,神魔战场,300)>    {S=◆ 进图条件:300礼卷;C=19}   {S=◆ 没实力切勿前往;C=154}\\\\
                                            {S=◆ 地图难度:噩梦;C=243}\\\\
                {S=◆ 怪物星级:50亿-500亿;C=243}    {S=750级:;C=243} <{S=神舰之地;C=251}/@噩梦地图(神舰之地,500)>    {S=◆ 进图条件:500礼卷;C=19}        {S=进入条件:1000礼卷;C=150}\\\\
                                                                                            <{S=开始挑战;C=251}/@暗黑地图(暗黑魔神遗迹,1000)>\\\\
                              `
            break
            case 10:
                S = `\\\\\\\\\\\\
                                             {S=◆ 地图难度:普通;C=250}                           {S=★★★地狱地图★★★;C=243}\\\\
                 {S=◆ 怪物星级:5亿-50亿;C=250}       {s=800级:;c=250}{s=〖;c=250}<血狱皇陵/@传送啊(800,血狱皇陵,200)>{s=〗;c=250}  {S=◆ 进图条件:200礼卷;C=19}  {S=◆ 地图名称:暗黑魔神遗迹;C=56}\\\\
                                             {S=◆ 地图难度:中等;C=251}                        {S=◆ 怪物星级:1000亿-10000亿;C=56}\\\\
                 {S=◆ 怪物星级:10亿-100亿;C=251}      {s=850级:;c=251}{s=〖;c=251}<暗夜大殿/@传送啊(850,暗夜大殿,400)>{s=〗;c=251} {S=◆ 进图条件:400礼卷;C=19}  {S=◆ 全部都是人形BOSS;C=56}\\\\
                                             {S=◆ 地图难度:高级;C=253}                        {S=◆ 全部为幻化级别;C=56}\\\\
                 {S=◆ 怪物星级:50亿-500亿;C=253}      {s=900级:;c=253}{s=〖;c=253}<血腥森林/@传送啊(900,血腥森林,600)>{s=〗;c=253} {S=◆ 进图条件:600礼卷;C=19}\\\\
                                             {S=◆ 地图难度:困难;C=254}                        {S=◆ 此地图怪物防御高,攻击强;C=154}\\\\
                 {S=◆ 怪物星级:100亿-1000亿;C=254}     {S=900级:;C=254} <{S=星空廊道;C=251}/@传送啊(900,星空廊道,800)>   {S=◆ 进图条件:800礼卷;C=19}  {S=◆ 没实力切勿前往;C=154}\\\\
                                             {S=◆ 地图难度:噩梦;C=243}\\\\
                 {S=◆ 怪物星级:200亿-2000亿;C=243}     {S=900级:;C=243} <{S=赤色战场;C=251}/@噩梦地图(赤色战场,1000)>   {S=◆ 进图条件:1000礼卷;C=19}    {S=进入条件:2000礼卷;C=150}\\\\
                                                                                             <{S=开始挑战;C=251}/@暗黑地图(暗黑血狱,2000)>\\\\
                               `
                break
            case 11:
                S = `\\\\\\\\\\\\
                                          {S=◆ 地图难度:普通;C=250}                         {S=★★★地狱地图★★★;C=243}\\\\
          {S=◆ 怪物星级:50亿-500亿;C=250}       {s=1000级:;c=250}{s=〖;c=250}<屠龙之路/@传送啊(1000,屠龙之路,400)>{s=〗;c=250}  {S=◆ 进图条件:400礼卷;C=19}  {S=◆ 地图名称:暗黑魔神遗迹;C=56}\\\\
                                      {S=◆ 地图难度:中等;C=251}                           {S=◆ 怪物星级:5000亿-50000亿;C=56}\\\\
          {S=◆ 怪物星级:100亿-1000亿;C=251}      {s=1200级:;c=251}{s=〖;c=251}<光明大殿/@传送啊(1200,光明大殿,600)>{s=〗;c=251} {S=◆ 进图条件:600礼卷;C=19}  {S=◆ 全部都是人形BOSS;C=56}\\\\
                                      {S=◆ 地图难度:高级;C=253}                           {S=◆ 全部为幻化级别;C=56}\\\\
          {S=◆ 怪物星级:500亿-5000亿;C=253}      {s=1400级:;c=253}{s=〖;c=253}<困兽之地/@传送啊(1400,困兽之地,800)>{s=〗;c=253} {S=◆ 进图条件:800礼卷;C=19}\\\\
                                      {S=◆ 地图难度:困难;C=254}                           {S=◆ 此地图怪物防御高,攻击强;C=154}\\\\
          {S=◆ 怪物星级:1000亿-10000亿;C=254}     {S=1400级:;C=254} <{S=边陲小岛;C=251}/@传送啊(1400,边陲小岛,1200)>   {S=◆ 进图条件:1200礼卷;C=19} {S=◆ 没实力切勿前往;C=154}\\\\
                                      {S=◆ 地图难度:噩梦;C=243}\\\\
          {S=◆ 怪物星级:2000亿-20000亿;C=243}     {S=1400级:;C=243} <{S=暴风营地;C=251}/@噩梦地图(暴风营地,2000)>   {S=◆ 进图条件:2000礼卷;C=19}    {S=进入条件:3000礼卷;C=150}\\\\
                                                                                        <{S=开始挑战;C=251}/@暗黑地图(暗黑北冥魔境,3000)>\\\\
                               `
                    break

        default:
            if (Player.GetLevel() >= 200) { Player.MessageBox('200级以上的玩家无法再进入新手地图!'); return }
            S = `\\\\\\\\\\\\
                                        {S=★普通地图★;C=250}                               {S=★★★地狱地图★★★;C=243}\\\\
            {S=◆ 地图难度:普通;C=250}                                                       {S=◆ 地图名称:暗黑比奇;C=56}\\\\
            {S=◆ 地图星级:原始★;C=250}                                                     {S=◆ 地图难度:地狱;C=56}\\\\
            {s=1级:;c=250}{s=〖;c=250}<郊外平原/@传送(1,郊外平原)>{s=〗;c=250}   {s=20级:;c=250}{s=〖;c=250}<天然洞穴/@传送(20,天然洞穴)>{s=〗;c=250}   {s=40级:;c=250}{s=〖;c=250}<矿区山谷/@传送(40,矿区山谷)>{s=〗;c=250}            {S=◆ 需要提升好实力才能挑战;C=56}\\\\
                                {S=首领:;C=251} <{S=沉息之地;C=243}/@传送(40,沉息之地)>\\\\
                                                                                {S=◆ 地图星级:百倍★★★;C=56}\\
                                {S=★★噩梦地图★★;C=19}\\
                                                                                {S=◆ 最底刷新星级为100★;C=56}\\
             {S=◆ 地图难度:噩梦;C=19}\\
                                                                                {S=◆ 全部都是人形BOSS;C=56}\\
             {S=◆ 地图星级:十倍★★;C=19}\\\\ 
            {S=◆ 地图怪物:最低刷新档次邪恶级BOSS;C=19}                                   {S=进入条件:10礼卷;C=150}\\\\ 
            {S=◆ 进图条件:1礼卷;C=19}\\
                                   <{S=邪恶洞穴;C=19}/@噩梦地图(邪恶洞穴,1)>                                           <{S=开始挑战;C=251}/@暗黑地图(暗黑比奇,10)>       
    `
            break
    }

    Npc.SayEx(Player, '世界BOSS', S)

}

export function 传送(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    let 级别 = Args.Int[0]
    let 地图 = Args.Str[1]
    if (Player.GetLevel() < 级别) { Player.MessageBox(`等级不足${级别},无法进入${地图}`); return }
    Player.RandomMove(地图)
}
export function 传送啊(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    let 级别 = Args.Int[0]
    let 地图 = Args.Str[1]
    let 礼卷数量 = Args.Int[2]
    if (Player.GetLevel() < 级别) { Player.MessageBox(`等级不足${级别},无法进入${地图}`); return }
    if (Player.GetGamePoint() < 礼卷数量) { Player.MessageBox(`礼卷不足${礼卷数量}点,无法进入${地图}`); return }
    Player.SetGamePoint(Player.GetGamePoint() - 礼卷数量)
    Player.GoldChanged()
    Player.RandomMove(地图)
}

export function 噩梦地图(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    let 地图名字 = Args.Str[0]
    let 礼卷数量 = Args.Int[1]
    if (Player.GetGamePoint() < 礼卷数量) { Player.MessageBox(`礼卷不足${礼卷数量}点,无法进入${地图名字}`); return }
    Player.SetGamePoint(Player.GetGamePoint() - 礼卷数量)
    Player.GoldChanged()
    Player.RandomMove(地图名字)
}

export function 暗黑地图(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    let 地图名字 = Args.Str[0]
    let 礼卷数量 = Args.Int[1]
    if (Player.GetGamePoint() < 礼卷数量) { Player.MessageBox(`礼卷不足${礼卷数量}点,无法进入${地图名字}`); return }
    Player.SetGamePoint(Player.GetGamePoint() - 礼卷数量)
    Player.GoldChanged()
    if (地图名字 == '暗黑苍月岛') {
        Player.MapMove(地图名字, 142, 332)
    } else { Player.RandomMove(地图名字) }

}

export function Main1(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    if (Player.V.任务1 == false) { Player.MessageBox('请先完成新手任务\\点击屏幕上方新手任务即可查看!'); return }
    const S = `\\\\\\\\
                    {S=◆ 地图难度:简单;C=250}\\\\
                    {S=◆ 地图星级:零颗★;C=250}\\\\
                    进入条件:60级以下\\\\
              {S=新人地图只刷新弱小和精英级别怪物;C=154}\\\\\\
                        <进入地图/@新手地图>
   `
    Npc.SayEx(Player, 'NPC小窗口', S)
}

export function 新手地图(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    if (Player.GetLevel() >= 60) { Player.MessageBox('60级以上不允许进入新手地图!'); return }
    Player.RandomMove('新手地图')

}