import { 装备属性统计 } from "../../核心功能/装备属性统计"
import { 特效 } from "../../_核心部分/基础常量"

export function Main(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    const S = `\\\\\\\\\\
           当前充值:${Player.V.真实充值}   充值满500可免费学习以下技能\\
                        或者书页足够也可免费学习\\\\\\
    职业技能1
    职业技能2
    职业技能3
    `
    let M = S
    switch (true) {
        case Player.V.战神:
            M = ReplaceStr(M, '职业技能1', `{S=召唤战神:[主动]使用技能召唤战神,可在庄园对战神进行强化;C=154}<{S=技能学习;X=410;HINT=条件1:消耗书页100个#92条件2:充值100以上可免费学习}/@技能学习(100,100,召唤战神)>\\    {S=战神继承攻击100%,每级+5%;C=154}\\\\`)
            M = ReplaceStr(M, '职业技能2', `{S=天神附体:[被动]受到的伤害减少20%,每3级增加1%;C=253}<{S=技能学习;X=410;HINT=条件1:消耗书页200个#92条件2:充值200以上可免费学习}/@技能学习(200,200,天神附体)>\\\\\\`)
            M = ReplaceStr(M, '职业技能3', `{S=万剑归宗:[主动]对周围5格敌人造成500%伤害,麻痹3秒;C=249}<{S=技能学习;X=410;HINT=条件1:消耗书页300个#92条件2:充值500以上可免费学习}/@技能学习(300,500,万剑归宗)>\\    {S=每级增加40%伤害.CD10秒;C=249}\\`)
            break
        case Player.V.骑士:
            M = ReplaceStr(M, '职业技能1', `{S=惩罚:[被动]被攻击时有5%几率冰冻敌方1秒,每2级提升1%;C=154}<{S=技能学习;X=410;HINT=条件1:消耗书页100个#92条件2:充值100以上可免费学习}/@技能学习(100,100,惩罚)>\\\\\\`)
            M = ReplaceStr(M, '职业技能2', `{S=愤怒:[被动]受到伤害时反击自身100%攻击给目标,每级增加20%伤害;C=253}<{S=技能学习;X=410;HINT=条件1:消耗书页200个#92条件2:充值200以上可免费学习}/@技能学习(200,200,愤怒)>\\\\\\`)
            M = ReplaceStr(M, '职业技能3', `{S=审判救赎:[主动]对5格范围目标每秒造成200%伤害,持续3秒;C=249}<{S=技能学习;X=410;HINT=条件1:消耗书页300个#92条件2:充值500以上可免费学习}/@技能学习(300,500,审判救赎)>\\    {S=每级提升40%伤害.CD10秒;C=249}\\`)
            break
        case Player.V.火神:
            M = ReplaceStr(M, '职业技能1', `{S=群星火雨:[主动]释放技能对目标造成100%伤害,每级增加20%;C=154}<{S=技能学习;X=410;HINT=条件1:消耗书页100个#92条件2:充值100以上可免费学习}/@技能学习(100,100,群星火雨)>\\\\\\`)
            M = ReplaceStr(M, '职业技能2', `{S=致命一击:[被动]每级增加0.01倍攻;C=253}<{S=技能学习;X=410;HINT=条件1:消耗书页200个#92条件2:充值200以上可免费学习}/@技能学习(200,200,致命一击)>\\\\\\`)
            M = ReplaceStr(M, '职业技能3', `{S=火墙之术:[被动]释放一个火墙对目标造成100%伤害,每级增加20%;C=249}<{S=技能学习;X=410;HINT=条件1:消耗书页300个#92条件2:充值500以上可免费学习}/@技能学习(300,500,火墙之术)>\\`)
            break
        case Player.V.冰法:
            M = ReplaceStr(M, '职业技能1', `{S=魔法盾:[主动]释放后可吸收部分伤害;C=154}<{S=技能学习;X=410;HINT=条件1:消耗书页100个#92条件2:充值100以上可免费学习}/@技能学习(100,100,魔法盾)>\\\\\\`)
            M = ReplaceStr(M, '职业技能2', `{S=冰霜之环:[被动]每3秒对3格敌人造成100%伤害,冰冻1秒;C=253}<{S=技能学习;X=410;HINT=条件1:消耗书页200个#92条件2:充值200以上可免费学习}/@技能学习(200,200,冰霜之环)>\\    {S=每级提升20%伤害;C=253}\\\\`)
            M = ReplaceStr(M, '职业技能3', `{S=寒冬领域:[主动]对5格范围内目标造成300%伤害,并且冰冻4秒;C=249}<{S=技能学习;X=410;HINT=条件1:消耗书页300个#92条件2:充值500以上可免费学习}/@技能学习(300,500,寒冬领域)>\\    {S=每级提升40%伤害.CD15秒;C=249}`)
            break
        case Player.V.驯兽师:
            M = ReplaceStr(M, '职业技能1', `{S=嗜血狼人:[主动]召唤一个嗜血狼人远程攻击,攻击目标时给人物回血;C=154}<{S=技能学习;X=410;HINT=条件1:消耗书页100个#92条件2:充值100以上可免费学习}/@技能学习(100,100,嗜血狼人)>\\    {S=继承攻击100%.每级加5%;C=154}\\\\`)
            M = ReplaceStr(M, '职业技能2', `{S=丛林虎王:[主动]召唤一只老虎,老虎在人物身边时人物的暴击提高20%;C=253}<{S=技能学习;X=410;HINT=条件1:消耗书页200个#92条件2:充值200以上可免费学习}/@技能学习(200,200,丛林虎王)>\\    {S=继承攻击200%.每级加10%;C=253}\\\\`)
            M = ReplaceStr(M, '职业技能3', `{S=雷暴之怒:[主动]使用技能后,宠物攻击时附带群体雷电术;C=249}<{S=技能学习;X=410;HINT=条件1:消耗书页300个#92条件2:充值500以上可免费学习}/@技能学习(300,500,雷暴之怒)>\\    {S=持续40秒,CD60秒;C=249}`)
            break
        case Player.V.牧师:
            M = ReplaceStr(M, '职业技能1', `{S=恶魔附体:[被动]每级增加5%道术;C=154}<{S=技能学习;X=410;HINT=条件1:消耗书页100个#92条件2:充值100以上可免费学习}/@技能学习(100,100,恶魔附体)>\\\\\\`)
            M = ReplaceStr(M, '职业技能2', `{S=互相伤害:[被动]受到伤害对5格范围敌人造成50%伤害,每级加20%;C=253}<{S=技能学习;X=410;HINT=条件1:消耗书页200个#92条件2:充值200以上可免费学习}/@技能学习(200,200,互相伤害)>\\\\\\`)
            M = ReplaceStr(M, '职业技能3', `{S=末日降临:[主动]对5格范围敌人造成300%伤害,麻痹1秒;C=249}<{S=技能学习;X=410;HINT=条件1:消耗书页300个#92条件2:充值500以上可免费学习}/@技能学习(300,500,末日降临)>\\    {S=每级加40%,CD10秒;C=249}`)
            break
        case Player.V.刺客:
            M = ReplaceStr(M, '职业技能1', `{S=致命打击:[被动]攻击有10%几率获得1点暗影值,每级加1%几率;C=154}<{S=技能学习;X=410;HINT=条件1:消耗书页100个#92条件2:充值100以上可免费学习}/@技能学习(100,100,致命打击)>\\    {S=每级加2%暴击伤害;C=154}\\\\`)
            M = ReplaceStr(M, '职业技能2', `{S=增伤:[主动]消耗1点暗影值,增加暴击几率10%,每级加1%;C=253}<{S=技能学习;X=410;HINT=条件1:消耗书页200个#92条件2:充值200以上可免费学习}/@技能学习(200,200,增伤)>\\    {S=持续110秒,CD120秒;C=253}\\\\`)
            M = ReplaceStr(M, '职业技能3', `{S=暗影杀阵:[主动]闪现到目标处并对目标5格敌人造成500%伤害;C=249}<{S=技能学习;X=410;HINT=条件1:消耗书页300个#92条件2:充值500以上可免费学习}/@技能学习(300,500,暗影杀阵)>\\    {S=每级增加40%,CD10秒;C=249}\\`)
            break
        case Player.V.鬼舞者:
            M = ReplaceStr(M, '职业技能1', `{S=鬼舞之殇:[被动]攻击目标有10%几率恢复自身5%血量,每级提升1%;C=154}<{S=技能学习;X=410;HINT=条件1:消耗书页100个#92条件2:充值100以上可免费学习}/@技能学习(100,100,鬼舞之殇)>\\\\\\`)
            M = ReplaceStr(M, '职业技能2', `{S=鬼舞术:[被动]每过5秒钟攻击时对目标造成3次伤害,每次伤害为50%;C=253}<{S=技能学习;X=410;HINT=条件1:消耗书页200个#92条件2:充值200以上可免费学习}/@技能学习(200,200,鬼舞术)>\\    {S=每级增加30%;C=253}\\\\`)
            M = ReplaceStr(M, '职业技能3', `{S=群魔乱舞:[被动]每3秒对自身3格范围敌人造成300%伤害,每级增加20%;C=249}<{S=技能学习;X=410;HINT=条件1:消耗书页300个#92条件2:充值500以上可免费学习}/@技能学习(300,500,群魔乱舞)>\\`)
            break
        case Player.V.神射手:
            M = ReplaceStr(M, '职业技能1', `{S=生存:[被动]击杀目标后恢复自身1%血量,每6级增加1%;C=154}<{S=技能学习;X=410;HINT=条件1:消耗书页100个#92条件2:充值100以上可免费学习}/@技能学习(100,100,生存)>\\\\\\`)
            M = ReplaceStr(M, '职业技能2', `{S=复仇:[被动]每第三次攻击对目标造成200%伤害,每级增加20%;C=253}<{S=技能学习;X=410;HINT=条件1:消耗书页200个#92条件2:充值200以上可免费学习}/@技能学习(200,200,复仇)>\\\\\\`)
            M = ReplaceStr(M, '职业技能3', `{S=神灵救赎:[主动]对目标5格范围敌人造成400%伤害,并且冰冻2秒;C=249}<{S=技能学习;X=410;HINT=条件1:消耗书页300个#92条件2:充值500以上可免费学习}/@技能学习(300,500,神灵救赎)>\\    {S=每级增加40%,CD10秒;C=249}`)
            break
        case Player.V.猎人:
            M = ReplaceStr(M, '职业技能1', `{S=人宠合一:[被动]你和你的宠物击杀目标都会使你和你的宠物恢复1%血量;C=154}<{S=技能学习;X=410;HINT=条件1:消耗书页100个#92条件2:充值100以上可免费学习}/@技能学习(100,100,人宠合一)>\\    {S=每6级增加1%;C=154}\\\\`)
            M = ReplaceStr(M, '职业技能2', `{S=宠物突变:[主动]将你的宠物变成远程群攻,伤害和生命提高100%;C=253}<{S=技能学习;X=410;HINT=条件1:消耗书页200个#92条件2:充值200以上可免费学习}/@技能学习(200,200,宠物突变)>\\    {S=持续30秒,CD60秒;C=253}\\\\`)
            M = ReplaceStr(M, '职业技能3', `{S=命运刹印:[主动]对5格范围敌人造成500%伤害,每级增加40%,CD10秒;C=249}<{S=技能学习;X=410;HINT=条件1:消耗书页300个#92条件2:充值500以上可免费学习}/@技能学习(300,500,命运刹印)>\\`)
            break
        case Player.V.武僧:
            M = ReplaceStr(M, '职业技能1', `{S=体质强化:[被动]每2秒回复自身2%血量,每8级增加1%;C=154}<{S=技能学习;X=410;HINT=条件1:消耗书页100个#92条件2:充值100以上可免费学习}/@技能学习(100,100,体质强化)>\\\\\\`)
            M = ReplaceStr(M, '职业技能2', `{S=至高武术:[主动]对自身3格范围敌人麻痹2秒,每10级提升1秒,CD12秒;C=253}<{S=技能学习;X=410;HINT=条件1:消耗书页200个#92条件2:充值200以上可免费学习}/@技能学习(200,200,至高武术)>\\\\\\`)
            M = ReplaceStr(M, '职业技能3', `{S=碎石破空:[主动]对自身5格范围敌人造成500%伤害,每级增加40%,CD10秒;C=249}<{S=技能学习;X=410;HINT=条件1:消耗书页300个#92条件2:充值500以上可免费学习}/@技能学习(300,500,碎石破空)>\\`)
            break
        case Player.V.罗汉:
            M = ReplaceStr(M, '职业技能1', `{S=金刚护体:[主动]释放后增加5%伤害,持续40秒,每级+5%,CD60秒;C=154}<{S=技能学习;X=410;HINT=条件1:消耗书页100个#92条件2:充值100以上可免费学习}/@技能学习(100,100,金刚护体)>\\\\\\`)
            M = ReplaceStr(M, '职业技能2', `{S=擒龙功:[主动]将目标抓到自己身边并且冰冻2秒;C=253}<{S=技能学习;X=410;HINT=条件1:消耗书页200个#92条件2:充值200以上可免费学习}/@技能学习(200,200,擒龙功)>\\    {S=每10级增加1秒冰冻时间,CD15秒;C=253}\\\\`)
            M = ReplaceStr(M, '职业技能3', `{S=轮回之道:[主动]召唤一只转生兽,转生次数越高,召唤兽越牛B;C=249}<{S=技能学习;X=410;HINT=条件1:消耗书页300个#92条件2:充值500以上可免费学习}/@技能学习(300,500,轮回之道)>\\    {S=继承人物200%武术,每级+10%;C=249}`)
            break

    }
    Npc.SayEx(Player, 'NPC中窗口', M)
}

export function 技能学习(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    let Magic: TUserMagic
    let 书页数量 = Args.Int[0]
    let 充值积分 = Args.Int[1]
    let 技能名字 = Args.Str[2]
    Magic = Player.FindSkill(技能名字)
    if (Magic) { Player.MessageBox('你已经学习了此技能,无法重复学习'); return }
    if (Player.V.真实充值 >= 充值积分) {
        Player.AddSkill(技能名字);
    } else if (Player.GetItemCount('书页') >= 书页数量) {
        if (技能名字 == '群魔乱舞') {
            // Player.ShowEffectEx2(特效.鬼舞群魔乱舞, -10, 20, true, 99999)
        }
        Player.AddSkill(技能名字);
        Npc.Take(Player, '书页', 书页数量)
    } else {
        Player.MessageBox(`你的充值积分不足${充值积分}点或书页不足${书页数量}个\\无法学习${技能名字}!`)
    }
}


export function 神之使者(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {

    const S = `\\\\\\\\\\
        当前守护等级:${Player.V.神之守护}\\
        {S=神之守护:可获得神之守护的加成,使你所受的伤害降低;C=251}\\
        {S=每提升一级,伤害减免1%,最高减免50%;C=151}\\\\
        {S=升级需求:守护晶石 * ${(Player.V.神之守护 + 1) * 100}个;C=191}\\
        {S=升级需求:守护灵石 * ${(Player.V.神之守护 + 1) * 100}个;C=191}\\
        {S=升级需求:  元宝  * ${(Player.V.神之守护 + 1) * 10000}个;C=191}\\\\       

        <{S=提升守护;HINT=50阶封顶}/@提升守护>           \\

`
Npc.SayEx(Player, 'NPC中窗口', S)

}
export function 提升守护(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    let S = ''
    if (Player.V.神之守护 >= 50) {
        Player.MessageBox('你已经是50级守护了,无法升级')
        return
    }
    if (Player.GetItemCount('守护晶石') < (Player.V.神之守护 + 1) * 100) { Player.MessageBox(`守护晶石不足${(Player.V.神之守护 + 1) * 100}个,无法强化`); return }
    if (Player.GetItemCount('守护灵石') < (Player.V.神之守护 + 1) * 100) { Player.MessageBox(`守护灵石不足${(Player.V.神之守护 + 1) * 100}个,无法强化`); return }
    if (Player.GetGameGold() < (Player.V.神之守护 + 1) * 10000) { Player.MessageBox(`元宝不足${(Player.V.神之守护 + 1) * 10000}个,无法强化`); return }

    Npc.Take(Player, '守护晶石', (Player.V.神之守护 + 1) * 100)
    Npc.Take(Player, '守护灵石', (Player.V.神之守护 + 1) * 100)
    Player.SetGameGold(Player.GetGameGold() - (Player.V.神之守护 + 1) * 10000)
    Player.GoldChanged()

    Player.V.神之守护 = Player.V.神之守护 + 1
    
    Player.SendMessage(`升级成功,当前{S=守护等级;C=154}:${Player.V.神之守护}`, 1)
    装备属性统计(Player,undefined,undefined,undefined);

}
