import { 实时回血, 数字转单位2, 数字转单位3 } from "../../大数值版本/字符计算"
import { 装备属性统计 } from "../../大数值版本/装备属性统计"

const 战神骑士 = `\\\\\\
                            职业分支:战神                                                                      职业分支:骑士\\\\
          {S=狂怒:[被动]10%几率造成200%伤害,每级增加20%伤害;C=250}                                {S=圣光打击:[被动]攻击目标时20%的几率对3格范围敌人造成100%伤害,每级增加20%;C=250}\\\\
          {S=召唤战神:[主动]使用技能召唤战神,可在庄园对战神进行强化,;C=254}                       {S=愤怒:[被动]受到伤害时反击自身100%攻击给目标,每级增加20%伤害;C=254}\\
          {S=战神继承攻击100%,每级+5%;C=254}\\
          {S=战神附体:[被动]每级增加5%生命值;C=251}                                               {S=防御姿态:[被动]每级提升15%防御;C=251}\\\\
          {S=天神附体:[被动]受到的伤害减少20%,每3级增加1%;C=154}                                  {S=惩罚:[被动]被攻击时有5%几率冰冻敌方1秒,每2级提升1%;C=154}\\\\
          {S=万剑归宗:[主动]对周围5格敌人造成300%伤害,麻痹3秒;C=253}                              {S=审判救赎:[主动]对5格范围目标每秒造成200%伤害,持续3秒;C=253}\\
          {S=每级增加40%伤害.CD10秒;C=253}                                                        {S=每级提升40%伤害.CD10秒;C=253}\\\\\\
                             <选择职业/@职业选择.职业选择(1,战神,0)>                                                                            <选择职业/@职业选择.职业选择(2,骑士,0)>`
const 冰法火法 = `\\\\\\
                            职业分支:火神                                                                      职业分支:冰法\\\\
          {S=法术奥义:[被动]每级增加3%魔法;C=250}                                                 {S=暴风雨:[主动]对目标3格敌人造成100%伤害,15%几率冰冻1秒,每级提升20%伤害;C=250}\\\\
          {S=闪现:[主动]在屏幕中5格距离任意传送.CD5秒;C=254}                                      {S=魔法盾:[主动]开启后可吸收部分伤害;C=254}\\\\
          {S=致命一击:[被动]每级增加0.01倍攻;C=251}                                               {S=冰霜之环:[被动]每3秒对3格敌人造成100%伤害,冰冻1秒,每级提升20%伤害;C=251}\\\\
          {S=火墙之术:[被动]目标受到伤害后脚下会释放一个火墙,造成100%伤害,每级增加20%;C=154}      {S=打击符文:[被动]每级增加4%伤害;C=154}\\\\
          {S=群星火雨:[主动]释放技能对目标造成100%伤害,每级增加20%;C=253}                         {S=寒冬领域:[主动]对5格范围内目标造成300%伤害,并且冰冻4秒;C=253}\\
                                                                                        {S=每级提升40%伤害.CD15秒;C=253}\\\\\\
                             <选择职业/@职业选择.职业选择(3,火神,1)>                                                                            <选择职业/@职业选择.职业选择(4,冰法,1)>`
const 驯兽牧师 = `\\\\\\
                             职业分支:驯兽师                                                                     职业分支:牧师\\\\
          {S=萌萌浣熊:[主动]召唤一只浣熊,继承攻击100%,每级+5%;C=250}                              {S=剧毒火海:[主动]对目标3格范围敌人造成100%伤害并且中毒,每级增加20%;C=250}\\\\
          {S=凶猛野兽:[被动]每级增加宠物10%攻击和血量,攻速和移速提高6点;C=254}                                      {S=妙手回春:[主动]使用技能,让附近5格队友回血,恢复为道术的2倍,每级加20%;C=254} \\\\
          {S=嗜血狼人:[主动]召唤一个嗜血狼人远程攻击,攻击目标时给人物回血;C=251}                  {S=互相伤害:[被动]受到伤害对5格范围敌人造成200%伤害,每级加20%;C=251}\\
          {S=继承攻击100%.每级加5%;C=251}\\
                                                                                        {S=恶魔附体:[被动]每级增加5%道术;C=154}\\
          {S=丛林虎王:[主动]召唤一只老虎,老虎存在时人物的暴击提高20%;C=154}\\
          {S=继承攻击200%.每级加10%;C=154}                                                        {S=末日降临:[主动]对5格范围敌人造成300%伤害,麻痹1秒,每级加40%,CD10秒;C=253}\\\\
          {S=雷暴之怒:[主动]使用技能后,宠物攻击时附带群体雷电术,持续40秒,CD60秒;C=253}\\\\
                             <选择职业/@职业选择.职业选择(5,驯兽师,2)>                                                                            <选择职业/@职业选择.职业选择(6,牧师,2)>`
const 刺客鬼舞者 = `\\\\\\
                            职业分支:刺客                                                                      职业分支:鬼舞者\\\\
          {S=潜行:[主动]可以对人和怪物隐身,隐身时无法使用技能和道具,获得2点暗影值,CD5秒;C=250}       {S=鬼舞斩:[被动]对周围2格敌人造成100%伤害,每级提升20%;C=250}\\\\
          {S=弱点:[主动]消耗1点暗影值,释放技能对自身4格范围敌人造成200%伤害,每级增加20%;C=254}       {S=鬼舞术:[被动]每过5秒钟攻击时对目标造成3次伤害,每次伤害为50%,每级增加30%;C=254} \\\\
          {S=致命打击:[被动]攻击有10%几率获得1点暗影值,每级加1%几率,每级加2%暴击伤害;C=251}          {S=鬼舞之殇:[被动]攻击目标有10%几率恢复自身5%血量,每级提升1%;C=251}\\\\
          {S=增伤:[主动]消耗1点暗影值,增加暴击几率10%,每级加1%,持续110秒,CD120秒;C=154}              {S=鬼舞者:[被动]每级增加5%刺术;C=154}\\\\\\
          {S=暗影杀阵:[主动]闪现到目标处并对目标5格敌人造成500%伤害,每级增加40%,CD10秒;C=253}        {S=群魔乱舞:[被动]每3秒对自身3格范围敌人造成300%伤害,每级增加20%;C=253}\\\\\\
                             <选择职业/@职业选择.职业选择(7,刺客,3)>                                                                            <选择职业/@职业选择.职业选择(8,鬼舞者,3)>`

const 神射手猎人 = `\\\\\\
                            职业分支:神射手                                                                      职业分支:猎人\\\\
          {S=复仇:[被动]每第三次攻击对目标造成200%伤害,每级增加20%;C=250}                      {S=分裂箭:[被动]对目标3格范围敌人造成100%伤害,每级增加20%;C=250}\\\\
          {S=成长:[被动]每级增加5%射术;C=254}                                                  {S=召唤宠物:[主动]召唤一只宠物,继承人物射术100%攻击,每级增加+5%;C=254}\\\\
          {S=生存:[被动][被动]击杀目标后恢复自身10%血量,每6级增加2%;C=251}                      {S=宠物突变:[主动]将你的宠物变成远程群攻,伤害和生命提高100%,持续30秒,CD60秒;C=251}\\\\
          {S=万箭齐发:[主动]对目标3格敌人造成100%伤害,每级增加20%;C=154}                       {S=人宠合一:[被动]你和你的宠物击杀目标都会使你和你的宠物恢复1%血量,每6级增加1%,每级提高攻速移速6点;C=154}\\\\
          {S=神灵救赎:[主动]对目标5格范围敌人造成400%伤害,并且冰冻2秒;C=253}                   {S=命运刹印:[主动]对5格范围敌人造成500%伤害,每级增加40%,CD10秒;C=253}\\
          {S=每级增加40%,CD10秒;C=253}\\\\\\
                             <选择职业/@职业选择.职业选择(9,神射手,4)>                                                                            <选择职业/@职业选择.职业选择(10,猎人,4)>`
const 武僧罗汉 = `\\\\\\
                            职业分支:武僧                                                                      职业分支:罗汉\\\\
          {S=天雷阵:[被动]每秒对自身3格范围敌人造成100%伤害,每级增加20%;C=250}                 {S=金刚护法:[被动]攻击时7%几率对目标5格范围敌人造成100%伤害,每级提升20%;C=250}\\\\
          {S=护法灭魔:[被动]每级增加5%武术;C=254}                                              {S=转生:[被动]消耗书页进行转生,每转+0.02倍攻,每重技能再加0.02倍攻;C=254}\\\\
          {S=至高武术:[主动]对自身3格范围敌人麻痹2秒,每10级提升1秒,CD12秒;C=251}               {S=金刚护体:[主动]释放后增加5%伤害,持续40秒,每级+5%,CD60秒;C=251}\\\\
          {S=体质强化:[被动]每2秒回复自身2%血量,每8级增加1%;C=154}                             {S=擒龙功:[主动]将目标抓到自己身边并且冰冻2秒,每10级增加1秒冰冻时间,CD15秒;C=154}\\\\
          {S=碎石破空:[主动]对自身5格范围敌人造成500%伤害,每级增加40%,CD10秒;C=253}            {S=轮回之道:[主动]召唤一只转生兽,转生次数越高,召唤兽越牛B;C=253}\\
                                                                                     {S=继承人物200%武术,每级+10%;C=253} \\\\\\
                             <选择职业/@职业选择.职业选择(11,武僧,5)>                                                                            <选择职业/@职业选择.职业选择(12,罗汉,5)>`
export function Main(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    const S = `\\\\\\\\\\\\\\\
                                战士                                法师                                道士\\
                             <{I=21;F=职业图标.DATA}/@职业选择.Main(1)>                         <{I=157;F=职业图标.DATA}/@职业选择.Main(2)>                         <{I=396;F=职业图标.DATA}/@职业选择.Main(3)>\\\\
                                刺客                               弓箭手                               武僧\\
                             <{I=5;F=职业图标.DATA}/@职业选择.Main(4)>                         <{I=183;F=职业图标.DATA}/@职业选择.Main(5)>                         <{I=305;F=职业图标.DATA}/@职业选择.Main(6)>\\\\
                           $职业$
    `
    let M = S
    let str = `<{S=我想重置我的职业;Hint=重新选择职业需要花费1000礼券;x=250;y=360;}/@@Question(确定重置职业吗？,@重置职业(1))>   <{S=我想重置我的种族;Hint=重新选择种族需要花费1000礼券;x=480;y=360;}/@@Question(确定重置种族吗？,@重置职业(2))>   <{S=查看种族详情;x=700;y=360;}/@职业选择.种族选择>`

    switch (true) {
        case Args.Int[0] == 1: M = ReplaceStr(M, '$职业$', `${战神骑士}`); break
        case Args.Int[0] == 2: M = ReplaceStr(M, '$职业$', `${冰法火法}`); break
        case Args.Int[0] == 3: M = ReplaceStr(M, '$职业$', `${驯兽牧师}`); break
        case Args.Int[0] == 4: M = ReplaceStr(M, '$职业$', `${刺客鬼舞者}`); break
        case Args.Int[0] == 5: M = ReplaceStr(M, '$职业$', `${神射手猎人}`); break
        case Args.Int[0] == 6: M = ReplaceStr(M, '$职业$', `${武僧罗汉}`); break
        default: M = ReplaceStr(M, '$职业$', ``); break
    }
    Npc.SayEx(Player, '职业选择', M + str)

}
export function 重置职业(Npc: TNormNpc, Player: TPlayObject, Args: TArgs): void {
    if(Args.Int[0] == 1){
        if (Player.V.战神 || Player.V.骑士 || Player.V.火神 || Player.V.冰法 || Player.V.驯兽师 || Player.V.牧师 ||
            Player.V.刺客 || Player.V.鬼舞者 || Player.V.神射手 || Player.V.猎人 || Player.V.武僧 || Player.V.罗汉) {
            if (Player.GamePoint < 1000) { Player.MessageBox('礼券不足1000,重置失败!'); return }
            Player.GamePoint -= 1000 
            Player.GoldChanged()
            delete Player.V.战神; delete Player.V.骑士; delete Player.V.火神; delete Player.V.冰法; delete Player.V.驯兽师; delete Player.V.牧师; 
            delete Player.V.刺客; delete Player.V.鬼舞者; delete Player.V.神射手; delete Player.V.猎人; delete Player.V.武僧; delete Player.V.罗汉; 
            Player.ClearSkill()
            Player.MessageBox('提示：\\\\重置职业完毕,请从新登录游戏\\否则5秒后踢出!')
            Player.SendMessage('重置职业完毕,请从新登录游戏\\5秒后踢出!')
            Player.DelayCallMethod('延时跳转.从新登录', 5000, false)
        } else {
            Player.MessageBox('你还没有选择职业，无需重置。');
        }
    } else {
        if (Player.V.种族 == '') { Player.MessageBox('你还未选择种族，无需重置。'); return }
        if (Player.GamePoint < 1000) { Player.MessageBox('礼券不足1000,重置失败!'); return }
        Player.GamePoint -= 1000 
        Player.GoldChanged()
        Player.V.种族 = ``
        装备属性统计(Player,undefined,undefined,undefined);
        Player.MessageBox('种族重置成功，请尽快重新选择你需要的种族。')
    }
}