/*装备data*/

export const 基础属性分割 = 0;// 分隔符
export const 装备类型 = 1;// 分隔符
export const 基础属性第一条 = 2;
export const 基础属性第十条 = 10;
export const 职业分割 = 11;
export const 职业第一条 = 12;
export const 职业第五条 = 16;
export const 专属符文第一 = 17;
export const 专属符文第二 = 18;
export const 专属符文第三 = 19;
export const 种族第一 = 20;
export const 种族第二 = 21;
export const 种族第三 = 22;
export const 种族第四 = 23;
export const 种族第五 = 24;
export const 装备增强一 = 25;
export const 装备增强二 = 26;
export const 装备增强三 = 27;
export const 天赋一 = 28;
export const 天赋二 = 29;
export const 天赋三 = 30;
export const 天赋四 = 31;
export const 天赋五 = 32;
export const 备用三 = 33;
export const 备用四 = 34;
export const 装备需求 = 40;




export enum 装备特效 {
    超级蓝水晶 = 101,
    传说1颜色=102,
    神话1颜色=103,
    传承颜色=104,
    史诗1颜色=105,
    绝世颜色=106,
    造化颜色=107,
    混沌颜色=108,
    时装马牌=109,
    神器特效=110,

稀有颜色 =102,
史诗颜色 =103,
传说颜色 =104,
神话颜色 =105,
远古颜色 =106,
不朽颜色 =107,

}

export enum 装备颜色 {
    劣质颜色 = 255,
    底材颜色 = 0,
    超强颜色 = 250,
    杰出颜色 = 154,
    传说1颜色 = 254,
    神话1颜色 = 251,
    传承颜色 = 244,
    史诗1颜色 = 241,
    绝世颜色 = 243,
    造化颜色 = 249,
    混沌颜色 = 128,

普通颜色 = 255,
精良颜色 = 0,
优秀颜色 = 250,
稀有颜色 = 154,
史诗颜色 = 254,
传说颜色 = 251,
神话颜色 = 244,
远古颜色 = 249,
不朽颜色 = 128,

}

export enum 尾部名字 {
    劣质名字 = '劣质',
    底材名字 = '底材',
    超强名字 = '超强',
    杰出名字 = '杰出',
    传说1名字 = '传说',
    神话1名字 = '神话',
    传承名字 = '传承',
    史诗1名字 = '史诗',
    绝世名字 = '绝世',
    造化名字 = '造化',
    混沌名字 = '混沌',


普通名字 = '普通',
精良名字 = '精良',
优秀名字 = '优秀',
稀有名字 = '稀有',
史诗名字 = '史诗',
传说名字 = '传说',
神话名字 = '神话',
远古名字 = '远古',
不朽名字 = '不朽',
}
